[{"title":"Wynd #5","publisher":"BOOM! Studios","writers":"James Tynion IV","artists":"Michael Dialynas & Aditya Bidikar","date":"2020-10-28","body":"This is it. The final issue of Wynd’s first step into a new world and life. This week we get the conclusion for the first volume of BOOM! Studios’ Wynd.\nYorik and Thorn are waiting on the hill for the Faerie General to come and get them. Wynd has run off aiming to misdirect the Bandaged Man and the rest of the King’s Men. Thorn and the prince have a serious talk about how Yorik has taken up an important mission and should start to act more like royalty. Wynd, in the meantime, also has a talk… with the Bandaged Man himself!\nJames Tynion IV has been making a lot of noise in the comic industry lately and Wynd is a great example as to just why. The writer has a great talent for writing compelling characters making all of them genuinely unique yet relatable in their own way. He’s able to take a somewhat boilerplate fantasy hero’s journey story and give it enough twists so that it feels incredibly fresh. Wynd is an amazing protagonist who we get to know most when he interacts with the rest of the diverse cast. The character grows in what could be considered a rushed manner, but it doesn’t feel like that at all. Little hints and nods at what’s coming is what made it all come together nicely by the end of this first volume.\nWithout a doubt, Michael Dialynas’ art is a crucial part of this comics’ soul. His style leans more towards the cute cartoony side. Nevertheless, the artists’ facial expressions are, at least for me, what most helped to sell the seriousness of the events of these last issues. His colors are more attached to the comics’ realism, being bright if it’s sunny and dark if the panel is underground. The highlight of his work, though, the character design! Good lord, I loved every single one of them. At first, the reader tends to notice the more blatantly awesome ones such as the Bandaged Man (both in and out of bandages) and the Faerie general. Later, however, even the more simply composed character bares these tiny details that inject an amount of soul into the said character and it just gets a lot better. My favorite instance of this is Wynd’s knee-tall converse shoes.\nAditya Bidikar is easily one of my favorite letterers out there. His bubbles and fonts are rather regular and get the job done, but as far as I see it, he shines when it comes to the sound effects. Not only they’re spectacularly well placed in order to get the most of every dramatic moment but they’re also well colored. The sound effects are given whatever color mixes in best with the page and brings forth a sense of volume to it. That’s just mind-blowing when you’re involved in the reading.\nThis was an epic first volume. As I mentioned early this could have just been another fantasy hero’s journey. It was a hero’s journey, but not just another one. Wynd takes many established tropes as a guide but never as a rule and the talented team behind it gives the soul of this comic that reflects just how much passion and dedication was put into this project. Wynd’s story is not over. This was just the beginning and I, for one, cannot wait for the next chapter.\n","score":9.3},{"title":"Dune: House Atreides #1","publisher":"BOOM! Studios","writers":"Writer: Brian Herbert & Kevin J. Anderson","artists":"Dev Pramanik, Alex Guimarães & Ed Dukeshire","date":"2020-10-24","body":"A few years ago I was introduced to the world of Dune through the 1984 David Lynch movie. I was mesmerized by the world building it did as well as the aesthetics presented in the film. However, I must admit, once I learned about the absolute tomes I’d have to read to get the full picture, I settled for getting a taste of different media. Now it’s time for comics.\nThe series’ first issue follows a collection of plots. We start with Baron Vladimir Harkonnen, on Arrakis, checking on a Spice deposit when an event called a Spice blow causes the deposit to collapse. The comic then jumps to Kaitain, with, Emperor Elrood notifying Planetologist Pardot Kynes he is to head to Arrakis and learn everything they need to know about the eternal mystery of the desert planet. There is a segment briefly following young Leto Atreides who is to go to Ix and learn more about the imperium. There is yet another subplot following the son of the Emperor plotting a plan to slowly assassinate him.\nAs it may seem from the summarized plot, the writing is not really good. I can’t really say how much this is to be attributed to the writers or the decision to make this comic a prequel (especially to the upcoming movie) but there’s clearly more than the two writers could properly handle. Dune is a rich universe with a ton of stories to tell, but to cram them all in a single issue right away was, in my opinion, an easy mistake to avoid. The writers get the job done, I guess. They do seem to rely on weird exposition spoken out loud about the characters’ past or literally about what’s happening on page which gets really annoying really quickly. Not to mention some weird dialogues altogether.\nHowever bad the plot or the writing may have been, the art does compensate quite a bit. Pramanik’s style is friendly and a bit cute but manages to impose seriousness and darkness whenever needed. His motion depiction is phenomenal placing the reader in the middle of the action with a general blur on the panel associated with motion lines. The artist’s anatomy can be odd in some cases. Guimarães’ colors are equally cool. Lighting is outright perfect among the sunny environments and sci-fi computer panels. I adored how the shield covered Paulus Atreides is colored, with a precisely measured tint of blue without getting in the way of the other colors for the character. The lettering is alright. The dialogue boxes have a clear color definition so it’s easy to track if it’s a character card or an inner dialogue, for instance.\nAs someone who was excited to see how Dune would end up in a comic format, I have to say I was a little bit disappointed. Although the artwork was, indeed really good, it got obfuscated by the crazy amount of plots and just plain bad writing which violates the pinnacle rule of visual storytelling: show, don’t tell. I hope this series eventually picks up seeing as Dune has tremendous potential and I’d love to see it done properly on comics eventually.\n","score":6.3},{"title":"The Scumbag #1","publisher":"Image Comics","writers":"Rick Remender","artists":"Lewis Larosa , Moreno Dinisio & Rus Wooton","date":"2020-10-24","body":" \nWe all love a good scumbag story. From the evil kinds, such as Walter White, to the most peaceful of them, aka The Dude. This is a story about how the lowest of mankind is suddenly responsible for its salvation with an incredible amount of power to spice the mix. From the mind of masterpiece maker Rick Remender, this week we get The Scumbag.\nThe Scumbag opens up with an outside narrator preparing the reader for who we’re about to meet, as well as they can anyway. The man being the described sounds truly repulsive. Our protagonist, Ernie Ray Clementine, is a relic of a bygone era where life was all about sex, drugs, and rock and roll. The keyword being “bygone” since nowadays, Ernie is really just seen as a lazy junkie who represents wherever people DON’T want to get in their life. Anyway, Ernie is on and about his drug injecting business, when he stumbles upon a different syringe than the one he had previously prepared for himself. Turns out Ernie just injected himself with something called the Formula Maxima. A collection of nano-machines designed to make the body they’re injected into the perfect super spy and the savior of mankind. This happens in a time of certain convenience since there’s a bomb about to go off in New York, so we can count on him to solve that. Right? Right??\nRick Remender is a tremendous writer. That’s pretty much all you’d need to know, but I’ll clarify. In this first issue he makes a visible effort to make Ernie look as bad as he can an it is hilarious in its own way. Not only the protagonist is put in the most ridiculous and embarrassing situation anyone could ever imagine to be, but it is also right before he accidentally becomes the world’s perfect super spy. Remender also does an incredible job on Ernie’s description, through the eyes of that external narrator I mentioned earlier. The writer manages to give us a clear idea of just what Ernie considers important in life as well as providing an detailed description of the protagonist’s smell and looks in a manner that could make a sensible reader lightly gag in disgust.\nThe art in this book is downright amazing. I normally go about line art and coloring separately, but Larosa’s lines and Dinisio’s colors were so incredibly well blended in this comic that I must discuss them along with each other. Larosa’s work leans towards the realistic style. A lot of details in muscles, hair, and even in motion depiction, opting more for blurry elements rather than motion lines. Dinisio’s work does wonders to complements that approach. The lighting is abnormally precise on every single panel and sets the transition in tone from a busy NY bar to an early morning in NY streets in winter in a way that gives this comic a singular immersive read. Lettering in this first issue bears its charms, despite not deviating from what we usually see. We get a doozy heroin-induced singing from Ernie and some nicely placed sound effects on every major action contributing to the immersion I spoke of above.\nBeing a Rick Remender title, The Scumbag has already drawn attention to its release due to the writer’s (rightfully occurring) hype. However, Image’s new series is off to a promising start as we all expected. Not only because of Remender’s skillful writing but also because of an incredibly talented team that is creating this new title with him. I definitely recommend giving The Scumbag a read to see if it’s for you, because it is definitely for me.\n","score":9.8},{"title":"Daredevil #21","publisher":"Marvel Comics","writers":"Chip Zdarsky","artists":"Marco Checchetto, Mattia Iacono & Clayton Cowles","date":"2020-07-23","body":" \nAfter the last issue’s exhilarating events, this week we have the beginning of the next phase of Matt Murdock’s life. Zdarsky and Checchetto continue to bring us their take on Marvel’s man without fear.\nIf compared to the story’s last chapter, this one was a bit dull acting somewhat like an epilogue to the events that took place in issue #20. In this new issue, Murdock sticks to his word while surrendering himself to the NYPD. However, Murdock’s transport, guided by Detective Cole is intercepted by Foggy who proposes an alternative. Wilson Fisk receives a call from the Stromwyn siblings, this time, choosing to hang up on them setting a somber tone to what might come to Hell’s Kitchen.\nZdarsky took his time with this issue. As usual, the writer knows where he’s going with his story and how he wants to get there. He takes the time to establish the interesting points of this new story arc. Zdarsky even manages to keep the writer a little on the edge with how Foggy’s plan for Daredevil to turn himself in end up happening by bringing a shift in the relationship between Matt and the D.A. Hochberg. This is the key to this week’s issue. Daredevil has stirred Hell’s Kitchen heavily and now that things are settling we get to see how bad his connections have been affected.\nI have commented on Checchetto’s work and his brilliance on the portrayal of human anatomy before. So what I chose to focus on this time was the artist’s work on backgrounds. At first, they’re quite humble, while the characters are still in the devastated landscape of Hell’s Kitchen. Although they get extremely superior once we move out of the destruction zone. The attention to detail given by the artist is amazingly realistic fading out as the elements in the background get further and further away.\nThis is all very well complemented by Matia Iacono’s work on the colors, of course. Since the destruction, we see a predominance of orange and black for all the fire and smoke that’s going around. This aids in the feeling of relief the reader might get once we see the wide panels showing us a dawning New York City. The colorist was also attentive to daylight progression as we start in a night set up and we feel the sun coming up on a new day in Murdock’s life, back as Daredevil. The lettering in this issue is pretty straight forward by Clayton Cowles. It focuses mostly on sound effects however using different fonts portraying the possible echo that sound might have in real life.\nThis is the beginning of the next phase of Daredevil’s story as told by Zdarsky and Checchetto. It reads a bit slow as not much happens but it is crucial to the plot so I do recommend a read if the reader is eager to keep up. If not, then the read is recommended anyways because of the truly stunning visuals.\n","score":null},{"title":"Vampire: The Masquerade Winter’s Teeth #1","publisher":"Vault Comics","writers":"Writer: Tim Seeley, Blake & Tini Howard","artists":"Devmalya Pramanik, Nathan Gooden","date":"2020-07-19","body":"Anyone who’s a fan of vampire movies, books, and whatnot probably remembers their reaction when first met with the world of Vampire: The Masquerade. Originally a TTRPG this world of bloodsuckers had incredibly well-built lore and social structure. This was the ultimate vampire storytelling with all kinds of vampires involved each with their own special abilities. VTM: Winter’s Teeth is Vault‘s contribution to this rich universe of darkness through the beautifully versatile medium that is comic books.\nThe comic actually presents us with two storylines. Winter’s Teeth follows Cecily Baine, an errand runner for the leader of the Twin Cities Camarilla, Prince Samantha Merrain. Baine mostly keeps to herself whenever not carrying Camarilla business. Cecily cares for her younger sister, Karen, who’s already an old lady and suffers from Alzheimer’s. Our protagonist is currently disputing whether to embrace her sister but stumbles upon a young girl who’s already been bitten, Alejandra. The secondary story, The Anarch Tales, follows a small band of vampires who live on the run from blood fix to blood fix but then start being followed by a band of vampire hunters.\nTim Seeley conducts the main story with tremendous talent. Seeley manages to give this new vampire story a similar tone to what VTM‘s franchise has established along the years on the first few pages of the book. The violent and dark start to the plot followed by the lonesome singing and narration Cecily presents is an immediate reminder of how much of a curse a vampire’s life can be. This and Cecily’s smart decision to not meddle to deep in Camarilla business make for a compelling character as she’s a vampire making her unliving as she must, in order to protect the last fragment of humanity she clings to her sister. Blake and Tini Howard write the secondary storyline and do so quite nicely. They adopt a similar kind of narration storytelling but verging a bit on the opposite of what Seeley does.\nDevmalya Pramanik’s work on the main storyline is sublime from the start. The artist focuses a lot on detailing and shading elements in a specific way to convey the object’s texture precisely. His movement depiction is equally mesmerizing. Nathan Gooden’s work on The Anarch Tales is a nice contrast to Pramanik’s. The artist takes advantage of simpler elements in the background and giving more attention to cloth and hair detailing.\nAddison Duke colors both stories in the comic book and that says a lot about the work on its own. To skillfully put color in two completely different art styles that go in the same book is always commendable. Duke makes every panel seem naturally lit which always helps with immersions and puts differently shaded filters in the stories either to immediately convey a flashback or an enraged vampire attack of Alejandra’s. The lettering is taken care of by Andworld and it is a solid job leaning towards more classic approaches such as different shaped bubbles for dialogues coming from cellphones.\nThe Vampire: The Masquerade universe has hit the comic book medium and it has hit hard. The first issue cautiously sets up a mystery that is doomed to unveil amidst a lot of blood. The art is composed by a talented team that is making the best of bringing the aesthetics of VTM‘s urban fantasy into comics. This is an easy recommendation from me and a series I intend to follow.\n","score":8.8},null,{"title":"Dead Body Road: Bad Blood #1","publisher":"Image Comics","writers":"Justin Jordan","artists":"Benjamin Tiesma, Mat Lopes and Pat Brosseau","date":"2020-06-24","body":"As anyone who’s a fan of comics like 100 Bullets or Criminal can tell you crime stories make for quality comic books whenever approached right, just like any other genre. Dead Body Road had its first iteration around seven years ago this week, we get a brand new start for a brand new story.\nThis new title’s story starts off with a man presenting himself as Monk. He starts this series’ plot similar to the first one. A crime has happened, somebody got played and Monk – a.k.a Mr. Sinclair – is beating answers out of people. Now he needs to find Bree Hale’s, our protagonist, brother. The comic then cuts to Bree at a normal night at her bar. Stopping drunkards from driving themselves to death and fights from wrecking the place. Bree is inquired about her brother by Detective Marshall, with whom she appears to share some intimacy. Later one of Sinclair’s men comes over asking the same question. It is then that wheels start turning.\nJustin Jordan did an incredible work on the first series of DBR but this single first issue got me more excited than the entire 2013’s comic. The pacing in this chapter is astonishingly precise about creating suspense and giving hints on who knows who in this crime-filled setting we’re presented. The writer himself states, crime fiction is one of his favorite reading genres and it shows. The amount of mastery Jordan displays with this first chapter is unbelievable. How would you hype up a character without constantly mentioning their past deeds in passing like we get a lot in John Wick? Well, the writer schooled me on that one, that’s for sure. When I reached the twist so cleverly set I was hooked.\nTo be honest, on the first few pages I wasn’t really sold on Benjamin Tiesma’s line art. Some close-ups look a bit weird and didn’t exactly fit the character presented to us before. I’m guessing, a bit overdone on light/shades on some of the characters might not have helped. Towards the end of the first chapter, we get these darker scenes which worked best with Tiesmas’ lines greatly similar to Giuseppe Camuncoli’s work except with much more texture and details applied. The artist’s facial expressions and motions are on point in every single panel really bringing the action to life.\nAlthough I did mention some misalignment between colors and lines at the first few pages I have to commend Mat Lopes’ work. Ever since I found out about him his work has mesmerized me at every turn. Not only his choice of colors is impeccable to portray the rural town this comic is set on, but the way he applies the lighting onto the scenes’ elements is amazingly accurate. Despite the skin glowing too much, in my opinion, it starts happening less often towards the end of the issue where it starts to go for precision rather than denoting the characters’ expressions.\nPat Brosseau’s lettering is discreet meaning it does its job well. He did, however, add some nice wriggly dialogue balloons which serve to convey the fainting voice of a beat-up man. I could use some more onomatopoeia, especially since this should be an action drive comic, and I, personally, think the sound effects can help tons with the immersion.\nOverall this was a fantastic read. I hadn’t read a crime story since last year so it’s refreshing to have a go after all this time and get this much quality. If you’re a fan of crime comics then you’re definitely picking this up for it is even better than the first iteration and I’m expecting it to maintain that standard.\n \n","score":7.5},{"title":"Black Stars Above Vol 1","publisher":"Vault Comics","writers":"Lonnie Nadler","artists":"Jenna Cha, Brad Simpson, Hassan Ostmane-Elhaou","date":"2020-06-24","body":"To approach the 1800s United States setting in the middle of the winter and to focus on a family of descendants of North America’s First Nation can sound interesting on its own. The aggressive nature of that period’s winter set in a deep forest could make for a horror like nature story. To kick it up a notch by introducing cosmic horror elements to the plot it’s plain bold. That’s what creators went for when bringing about Black Stars Above.\nThe story follows Eulalie Dubois a young girl who has been tending to her family matters her whole life. Always isolated in a hut outside the nearest village, helping her father with the skinning of animals for leather manufacturing, her grandfather with his injuries, and her mother with the rest of the house chores. Right away we see Eulalie is a girl ahead of her time, who wants to travel North and know places and people. She reads and writes a lot, her writing being the main device for presenting us with her thoughts and reflections. With the winter being especially rough this year and her family having little to no means to sustain themselves, Eulalie’s father reveals that he’s made a deal to marry Eulalie off and move with the rest of the family for a job. Our protagonist is clearly furious with her dad’s decision and decides she will not stand for it. Then Eulalie’s adventure actually begins as she runs away from home in the middle of a winter night to deliver a package give to her by a stranger with white spots on his face that earlier that day.\nRight from the setup, Nadler’s knack for storytelling and character-building is evident. I believe I’d sympathized with Eulalie by the end of page 3 after her introduction. Not only she’s got a very strong resolve towards her life, despite living in the 1800 USA, but she’s a very righteous and fighting woman who is prepared to go to any lengths for her freedom as the book duly covers. Yet what I think is the most noteworthy aspect of this plot is how it confronts meeting the unknown in the wild with meeting the unknown in the cosmic horror sense. Eulalie knows she’s got a long hard path ahead of her if she wants to make the delivery. Because of that, she decides to push forward however she can when confronted with drawbacks being that a creepy hunter who has ill intent, a savage creature, or a hallucinatory dream of a dark moon calling to her in the middle of the night.\nJenna Cha’s line art is mesmerizing. The backgrounds are extremely high in detail and so are the facial expressions in characters which does wonder to bring about a crude organic feeling and a specific texture to every single one of this comic’s elements contributing deeply to the horror elements whenever they take the spotlight.\nThis book is predominantly white and black when it comes to color, not in a sense that it is simple but in a sense of contrast between two very different environments experienced by the main character one filled with the winter snow of the wild and the other with a dark mysterious glow of the night and of the unknown. That being said the book does give you a false sense of security and comfort once a scene transitions to the interior of a hut, for instance, near a lit fireplace. The drastic change from pale white to bright orange and brown really sells that warm feeling one can get when coming out of a cold weather. Another cool set up done by the predominance of the white & black is that, whenever there is an important element to this story in the scene, it is always pertinent to the story because it would indeed draw attention and drag the plot if it happened to us.\nThe lettering is pretty great in this book. Eulalie’s narrations is mostly portrayed by her journal so we constantly get this cursive font that stylizes the handwriting but without making it tiring (adding some crossed out bits also sells on how much we’re into this character’s story). However, one big problem for me in this book was the sudden cut to a full eight pages of a handwritten diary. Although this is relevant to the story and the font is not that bad in itself (it’s not even that different from the one used for Eulalie) I can’t see how this was the best decision for the comic. To give us full eight pages of cursive font brings the reading to a gigantic halt and can easily drive away those that have not yet been engaged.\nOverall this is a powerful comic. It set a bold plot with a nice cosmic horror story and an interesting open ending to it. The artwork is damn right gorgeous all the way through and helps a lot to sell the visceral aspect of the book. If you like cosmic horror and want to try a peculiar spin to it, I’d recommend giving this a shot. The full story of Black Stars Above is due to be released on July 29. It’s a slow read with heavily eerie moments and it should impress the horror fans.\n","score":8.0},{"title":"Wynd #1","publisher":"BOOM! Studios","writers":"James Tynion IV","artists":"Michael Dialynas & Aditya Bidikar","date":"2020-06-17","body":"It is hard being a teenager as most of the people who have gone through such a phase in life can attest. Like any other coming of age story, Wynd explores this transition into adulthood with a subtle hint of bitterness added to it. James Tynion IV is joined by once more by Michael Dialynas and talented letterer Aditya Bidikar to bring us what appears to be an engaging new hero’s journey fantasy.\nOur titular character, Wynd, has always lived in secrecy at the local tavern at Pipetown. He helps around in the kitchen and sneaks off whenever he can to venture out into the town and watch his crush from afar. What’s complicated is Wynd possesses a magical inheritance in his blood, characterized by his pointy ears. The folk of Pipetown treats people with such traits as monsters, unnatural, dubbing them Weirdbloods. That said, the king brought back to town a character only know as Bandaged Man, who imposes somber energies wherever he appears.\nDespite not being familiarized with Tynion’s work (I know, I know..) I could instantly tell he has a perfect hand on the pacing of his script. Wynd #1 starts off with a chilling and, honestly, quite sad, cold opening which comes to show that this story will not be a sweet ride all the time. That said, the comic cuts to the protagonist interacting with his friends in the tavern and it is incredibly heartwarming, especially considering the somber tone we’re just given back at the first few pages. His friends are all very nice and gentle which is awesomely reflected in their designs. Wynd has a crush on the groundskeeper son, who he watches jogging every now and then and it was incredibly relatable how Tynion portrayed that bit. That excitement of just being able to glance at someone you can see your whole life revolving around when you’re younger. Really refreshing stuff I must say.\nBoth line art and colors are composed by Michael Dialynas (who’s worked with the writer before on The Woods) and there are quite a lot that’s done right. Although Dialynas backgrounds are somewhat plain they fit together really well with his character design which, despite also being more on the minimalist side, stand out with the choice of colors and the amazing care for expression lines given by the artist. A few nips here and there and Dialynas manages to give us a sort of feel to the characters touch. This is blatantly obvious when the tavern owner, Miss Molly, is shown in the very next panel after Titus, the cook who is a big, scarred, fella, is presented to us.\nBidikar’s letters are always nice to read, even if unnoticed at first. Not only he keeps the dialogue going on nicely set bubbles but also helps with the flow of the story throwing in some onomatopoeia seamlessly embodied into the element making the sound and always following the reading flow of the page perfectly, which really just does wonders for immersion, at least for me.\nI’m not really a big avid medieval fantasy reader but I really enjoyed reading Wynd. The experience set up by the amazingly assembled cast of professionals really comes across. The fact that every issue is double the length of regular ones also helps as this is a comic you should really enjoy if you take a while, sit down and take it all in.\n","score":7.8},{"title":"Excellence #7","publisher":"Image Comics","writers":"Brandon Thomas","artists":"Khary Randolph, Emilio Lopez, Deron Bennet","date":"2020-06-09","body":" \nExcellence is real and it is back! Image’s ongoing series has returned after the comic book drought and it is as compelling as ever.\nSpencer Dales has decisively stuck with his original plan, after being betrayed by his father, and we kick off with a mirror spell which Spencer uses to lose a squadron of Aegis’ wizards who have come for him, led by Dequan Hill. Our protagonist sets off into the night towards some key locations we see on the very first page of this chapter. Spencer is seeking to settle the final details of his master plan against the Aegis and no infamous wizard will stop him now.\nThomas’ choice for highly non-linear storytelling is, as far as I can tell a “problem” in this issue. I state that lightly as we all have to consider that no creative team was expecting the recess in comic distribution we had this year, even more so if the series started last year. Nonetheless, unless you’re binge reading this comic from the beginning, this new issue can be a little confusing. Despite all that, Thomas still writes his characters in an incredibly heartwarming and relatable manner. Now consider that this is a decisive turning point in the story and Spencer seeking closure before a dangerous endeavor and the dialogues become even more cathartic. It’s also notable how smartly the writer used the mirror spell once again to approach multiple plot points at once without making it feel rushed at all.\nIt is a delight to read any comic illustrated by Khary Randolph. His movement depiction is on point, particularly if we consider the subtle motions reproduced in the characters’ clothing floating with magic, on the snow falling down on the city and on a simple mist coming up from a cup of tea. Yet, what I love the most about his work are the facial expressions. The amount of change made to a character’s face against how it changes the feeling it gives forward is amazing. The coloring in this issue takes a bigger part since they’re used mainly to indicate which of Spencer’s clone we’re following at the moment. Sneakily inserting the backgrounds with an individual color until the many Spencers come to a simultaneous realization that their game of cat and mouse with Hill and his squad of wizards is up and we get a multicolored panel beautifully reflecting exactly what is happening on the narrative.\nWe get mainly three fonts in this issue’s lettering. There are some situational captions, as we had in previous issues, which show us which Spencer we’re following. There are squares that are nicely lettered to mimic Spencer’s diary. I use “nicely” because in most comics, whenever there is a diary-type font I can almost never read without squinting (yes, I do wear glasses). There is a third, standard font that is masterfully composed for the dialogue bubbles.\nExcellence continues to live up to its name with amazing creativity and talent. It should keep up the pace as long as it steers onto its conclusion and I hope dearly that it is reminded a long way down the line as a modern classic of comic books.\n \n","score":8.8},{"title":"The Boys: Dear Becky #1","publisher":"Dynamite Entertainment","writers":"Garth Ennis","artists":"Russ Braun, Tony Aviña & Simon Bowland","date":"2020-06-05","body":"For anyone who has read the original series of The Boys, being a fan or not, it is interesting to know Ennis still has stories to tell in that universe. A title conceived with a parody of DC Comics’ heroes and how their private personas clashed with their public ones, now brings forth, yet again, Billy Butcher’s past, this time through the lens of Wee Hughie who, since the ending of the original series, has opted for a calm and normal life with Annie.\nThe issue opens up with Hughie sitting in a pub, in Scotland, along with his friend Bobbi, a trans woman. Discussing being politically correct and alike. The comic takes us briefly away from the two friends at the pub to show us Hughie curled up in the bathroom trembling as he considers reading a mysterious book that is right in front of him. The chapter goes back to the two friends now discussing Hughie’s last twelve years and how the world’s been dealing with supes since then.\nThe first word in this chapter is an f-bomb. So, all I can say is, I’m glad this is being written by Ennis after all these years without a new entry on The Boys series. Not much happens in this first issue as much as the set up for the main conflict. Ennis manages to sneak in a gory throwback to a mission the Boys carried on before Mallory’s resignation and if you liked the original series’ gore, blunt violence, and raw perspective on the superhero question in-universe, well, it’s all back in the best Garth Ennis fashion. And, boy, oh boy, am I glad! I don’t think any other writer ever could do with characters and plots what Ennis usually does which can be extremely dumb and ridiculous but can shift to deep and meaningful in a single panel.\nRuss Braun to the world of the Boys as well and it’s just as welcome as Ennis. Despite baring somewhat more simplistic lines in his illustrations (especially if compared to Darick Robertson’s work which contains tons of details) I think the core of his work, at least for The Boys, is how well he nails the facial expressions which is a huge plus considering how snarky Ennis’ dialogue is and the range of emotions it can show. Along with the old cast’s reunion is Tony Aviña who returns as a colorist for the comic, complementing Braun’s lines beautifully giving it precise lighting in every panel despite keeping it simple and flat enough, to sum up perfectly along with the penciling.\nIf you’ve read up to this point and you’re a fan of The Boys original comic book series and any previous installations. If you’ve only watched the show, maybe it’s time to catch up on the slightly different plot points between comic and TV series in order to be able to keep up with this new title. With a great return of a legendary cast of artists, I, for one, am relieved and satisfied with the quality of this new iteration and cannot wait for the next issue.\n","score":7.5},{"title":"Promethea","publisher":"America’s Best Comics","writers":"Alan Moore","artists":"J.H.Williams III, Mick Gray, Jeremy Cox, José Villarrubia, Todd Klein","date":"2020-05-30","body":"It was during a warm Saturday in Brazil, about two years ago, when I first came across the face of Promethea. I took a quick glimpse at the cover, it was nice and colorful, filled with various elements of the story. Honestly, I didn’t give it too much importance. The art was beautiful, but something didn’t click,  i didn’t really care to know more about it. Blessed were the vendors at my LCB (shout out to Derek and Jhonny!) that drew my attention to it. I was a regular at the place so they knew what kind of titles I was interested in. First, they pointed out something they knew for sure, was going to pick up my interest: “writer: Alan Moore”. I was then given a quick and passionate summary about the contents of the title and was convinced, then and there, I had to read it.\nThe story of Promethea follows a college girl, Sophie Bangs, in the sci-fi New York of the year 1999 A.D.. Sophie had decided to write her term paper on a character named Promethea who keeps turning up on all kinds of media from many different times. From 18th century poems to comic books. Bangs figured she should interview Barbara Shelley, the wife of the last author of a Promethea comic book in order to complement her work. Barbara agreed to do the interview but is very dismissive about everything Sophie tries to bring up as peculiar and ends up just sending the girl home without anything to add. On her way home, Sophie is jumped by a shadowy lean creature. However, in the middle of the fall to her death, Sophie gets saved by none other than Promethea herself! The heroine is injured while fighting the creature, which she says is called “a smee”. Turns out that Promethea was Barbara Shelley and now she’s heavily injured and in risk of dying. So Shelley convinces Sophie that it’s her turn to steer Promethea to help others and that’s how we close the first issue.\nIt may seem, from the last paragraph that I was inconsiderate to the new reader about spoilers but trust me when I say that barely scratched the surface of the content one can find in the whole of the thirty-two issues of Promethea. As much as I like Watchmen and all the many other Moore masterpieces, I love this title on a deeply personal level. Not only because of how I happened to stumble upon it just as I was finding interest in mystic texts and history but because I feel that Promethea was a personal work for Moore himself. You see, in Watchmen and V for Vendetta, which are easily the ones I’ve read and re-read the most of Moore’s comics, we get to see the Mad Wizards’ political view on Britain, on the U.S.A., on superheroes and whatnot. Still, we don’t get to see the Mad Wizard as a wizard. Promethea is the comic in which Moore lets all of his mystic knowledge and beliefs out in a damn finely structured manner, that is to say, he devised the plot of the comic’s chapters and its narrative in order to best represent complex magical system like the Tarot deck of cards and the tree of life from the Kabbalah.\nI could write about the double of what I have already about the artwork in this comic. Not only J.H. Williams’s line art is amazing by itself but the final arts by Mick Gray and the colors by Vilarrubia show an enormous range of ability to go with the tremendous magical elements that Moore opted for describing in detail. Yet, what I love the most about it is the page composition, easily.\nPromethea not only defies storytelling on the way it was written but the panels in this title are insane! They reflect how the situations shown to take place in time even when time shouldn’t make sense. The most memorable one, in my opinion, is what I call the Infinity Page. Barbara and Sophie, traveling through an astral plane of sorts, realize they’ve been walking in a loop and start to hear each other voices. It’s a pretty cool concept on its own but Williams took up a full double-page panel to show the characters walking in an Infinity Helix. Want more? As long as you follow the loop the dialogue makes sense in every direction. I can’t even begin to explain how amazed and even more in love, I was when I reached this page.\nThe magical elements in Promethea are, as I mentioned before, what I believe to be Moore writing wholeheartedly about the systems he liked to study and practice the most while discovering magick and becoming The Mad Wizard we all know today. I guess what impressed me the most about it is the way he managed to tightly weave detailed elements of these ancient and complex systems into the plot. He could have settled by stating learning magick was part of Sophie’s journey as the new Promethea, and, sure, this is how he brings out most of the elements. Still, the story flows naturally into it in the weirdest of manners. I know the last statement seems contradictory, but this is just how good Moore was while making this comic. He uses elements of the story which lead to magical elements which lead to incredibly detailed explanations about fundamental truths and back again to futuristic New York. Needless to say, it is one hell of a ride whenever this kind of thing happens (which is most of the comic, thankfully).\nAnother aspect I think is worth mentioning is the world-building we get in Promethea. It’s easy to talk about the magical elements since its the book’s main focus, but I believe the massive world-building the creators added to this title takes great importance, not only for immersion purposes but also for the impact it causes at the end of the story. Moore and Williams created a dense city for the highly futuristic New York we get. The city has its defined locations such as bars and buildings that are pertinent to the plot. The city has its own superhero team, named The Five Swell Guys, as well as its own plethora of weird futuristic supervillains ranging from evil corporate wizards to rebellious murderous androids that look like clowns. We also get a few snippets of a recurrent radio news broadcast that lets us know how other elements of the world are evolving while we’re not following.\nI could go on and on about this comic for as long as I breathe. Unfortunately, there’s nothing quite like reading it first hand. Give it a try. The lettering and pages can be a bit intimidating at first, but that is so with most of Moore’s comics and they’re all worth the effort. This one especially, in my opinion, because not only you’re on a wild ride through a series of philosophical reflections from one of the greatest minds of our time, you’re in it along with pristine and immersive artwork, revolutionary storytelling and straight up just an amazing work of art. So.. yeah… I hope this comic sparks the love in you as it has done in myself because, I, for one, cannot get enough of Promethea.\n","score":null},{"title":"King of Nowhere #2","publisher":"BOOM! Studios","writers":"W. Maxwell Prince","artists":"Tyler Jenkins, Hilary Jenkins, Andworld Design","date":"2020-05-30","body":" \nDenis is a mysterious fellow who just woke up by the road one day and stumbled across the small town of Nowhere. A place where having six arms or no skin is actually quite normal and nobody cares at all really. Denis hangs around and finds himself involved in the town’s events while an unknown killer is on his track for some reason.\nThis second chapter picks up with Denis mid-dream where we can see he’s clearly running from something in his life and with what seems a direct recollection of what happened in the last issue with the giant iguana. Denis wakes up and we’re shown that he’s been crashing with Jed, the fish-man he helped out at the bar. We can instantly notice that our protagonist has gotten habituated to life in Nowhere. Despite the weird and bizarre being at every corner, Denis is trying his best to lead a normal life following Jed along on his wacky entrepreneurial ideas.\nThe only other work by writer W. Maxwell Prince’s I’ve ever read to this day is One Week in the Library. Coincidentally or not, King of Nowhere gives me a dreamlike sensation while reading it quite similar to OWitL. I was impressed once I realized they’re written by the same author but not quite surprised. Prince has a way of detaching the reader from the story along with the protagonist either in moments of reflection or just the plain obliviousness of the characters in frame regarding what may be happening just around the corner from them. It’s also worth noting how that helps the town of Nowhere feel organic. I mean, who does know about everything that goes in their hometown anyways?\nWhere can I begin about this comic’s artwork? It contains a gigantic variety of weird elements all duly embedded in a normal town. The fact that every new design is surprising yet familiar as one would see in a dream, for instance, is only reinforced by the composition of every page. The panels are framed with crayon-like lines and sometimes the elements escape their own panels to overlap onto others. While this was present in the first issue, the framing is new and helps to bring forth a feeling of disconnection between events despite the fluidity of the page. The coloring in this issue is composed of brighter tones than the last one and it is amazing how perfectly it complements the line art. Jenkins’ ability to portray a wide range of textures and daylight throughout this issue alone easily puts her work on my radar from now on as one of my favorites.\nKing of Nowhere is a nice addition to anyone’s pull this week for its compelling characters, world, and a plot that pulls you away from every day waking world into a quite regular dreaming world, but wondrous nonetheless. Composed by well-aligned group of professionals King of Nowhere is definitely worth the read.\n","score":8.9},{"title":"Twin Worlds #1 & #2","publisher":"Action Lab","writers":"Rami Al-Ashqar","artists":"Jethro Morales & Bryan Magnaye","date":"2020-05-12","body":"Twin Worlds mixes right off the bat various elements of science fiction and fantasy when two extremely different cultures collide after a portal leads humans from Earth, know as Earthers, to the world of Tassaroth. There the Earthers, well-armed with all kinds of battle spaceships and guns, subjugate the Tassonites in order to make a profit off of their resources.\nThe first chapter picks up with an incursion from Vin Raja, the Darukin of the land of Drakkara, attacking a group of Earther soldiers. We get to witness what could happen if a giant dragon was used to attack a metal-gear kind of machine and boy, oh boy, this comic kicks off greatly. The Earthers are subdued and among them are found some Zila men, Zila being a tribe native from Tassaroth. The story then cuts to the public square of Drakkara where the Zila are executed for working with the enemy. This is when we are vaguely introduced to our protagonists. The twins, Rea and Rakkan, both grandchildren of Vin Raja, who, despite showing them some care, does not properly recognize them as members of the royal family. You see, Kayla, Raja’s daughter and the mother of the twins, conceived them with a yet unknown Earther, and because of that, the children were born without the characteristic pointy ears of the Tassonite people.\nAlthough it may look like a lot of background knowledge is needed due to how rich the lore of this new world already is in the first issue, it all comes quite easily to the reader. I honestly have never seen this much backstory contained in such an elegant manner in merely ten pages or so. I’m obligated to compliment Rami Al-Ashqar’s writing. Exposition is done masterfully by the writer in a way that it feels extremely pertinent to the flow of the plot. Al-Ashqar also shows from such a choice of storytelling that Twin Worlds is supposed to be a saga. Our main characters, the Vin Twins, are barely shown in the first issues but they are promised to become far greater and more important throughout the series.\nJethro Morales did the line art for the comic and he appears to be more fond of the Tassaroth elements of the story than that of Earth’s. What I mean by that is when the comic is at Tassaroth the whole scene just looks richer. There are more details to the backgrounds and characters than there are to those in an Earther ship. The best of the Earther technology we get to see is at the very beginning of issue #1 and the scene also takes place in Tassaroth. This isn’t by any means a bad thing, of course. It could reflect how the Earthers are blindly attacking such beautiful land and making it dull just for profit. The colors, by Magnaye, also reinforce that impression. In the Earther ship, all we get are tones of blue and grey while on Drakkara the setting looks straight out of a painting of Greece. And the Tassonites all wear different colored garments, even though all the Drakkara military show the colors of their homeland, they mostly do it differently from the next one.\nTwin Worlds was a great surprise for me. I’m not the biggest fan of epic sagas but the boldness of combining science fiction and fantasy is always an interesting hook. The storytelling of this comics’ team is incredibly well aligned and I sure hope it gets a long run so we can see what will be of little Vin Rea and Vin Rakkan.\n","score":8.0},{"title":"John Constantine: Hellblazer (2019-) #5","publisher":"DC Comics","writers":"Simon Spurrier","artists":"Matías Bergara & Jordie Bellaire","date":"2020-03-29","body":"Last month, John Constantine met Tom Willowtree. A vegan, environmentalist wizard who does pun magic and claims to have succeeded John in being the One True Magelord of All England. Now, knowing that Constantine has returned, Tom asked him if he wants to claim back the position. Yet, John has no idea what he’s talking about.\nIn this new chapter, John wakes up after a night of heavy drinking with Tom Willowtree. Constantine wakes up and realizes just how kind and different he actually is from Tom and wonders why and how the mystagogue has heard of him, especially as an authority figure in England’s magick scene since we all know very well, everyone hates John’s guts. At first, Con-job plays along with Tom and his rambles about England’s mage lord but only so he can sneak out of Willowtree’s apartment and find out what the hell is going on.\nSpurrier continues to deliver in this new iteration of Hellblazer. Every story brings out the most sarcastic and witty of John Constantine and it really hits the spot for a classic Vertigo fan. That is without mentioning the absolute genius of John’s new companions, Willowtree being the most recent one, a hipster, an environmentalist mage who does pun magick and is John’s extreme opposite. This not only makes John’s traits stand out even more but creates interesting exchanges between the culture of the past and the culture of today in the best, “Damn, I just wanted bacon” kind of way.\nThe artist who steps in for the line-art in this new story-arc is Matías Bergara. I don’t actually have much to say about Bergara’s work because I just love it all. What I think I liked the most, however, is that it helped to establish the contrast between the modern, smiling mage Tom (portrayed with smooth lines and not many details in his expressions) and the classic, beaten-up frowning John Constantine (shown with a lot of expression lines and other details like a poorly maintained beard and dark circles under his eyes).\nThis reviewer also has to commend, once again, the colorist, Jordie Bellaire who stayed after the story-arc change and adapted to Bergara’s completely different style incredibly! The colors compliment the details I mentioned about the line-art beautifully. Bellaire’s work also does wonders for Bergara’s backgrounds changing the setting in a way more impactful manner through colors and shadows rather than through the elements they contain.\nThis new issue in Hellblazer‘s new series has been another joyful read for any magick and urban fantasy fan. The mystery elements are being written masterfully by Spurrier and the art is an eyeful in every panel with a talented team of penciler and colorist. Once again, I recommend picking up this title now, before it goes on for a long time and you have to catch up on too much because you’re probably going to want to read it all eventually.\n","score":9.3},{"title":"Artemis & The Assassin #1","publisher":"Aftershock Comics","writers":"Stephanie Phillips","artists":"Francesca Fantini & Meghan Hetrick","date":"2020-03-19","body":"Whatever is it that interests me in stories about time-traveling agents managed by a whole bureaucratic organization I don’t know. However, when I read the synopsis for Artemis & The Assassin I just had to know how that idea was going to play. So here is what I thought of the story’s starting point.\nThis issue contains two basic segments. The first one starts off by presenting Maya, an assassin for a time-traveling organization that offers its services to kill important historic figures in order to alter the course of history. Maya is shown to be an exceptional assassin but hot-headed and with a strange relationship with her superior, Isak.\nWe then cut to a red-haired woman shooting a Nazi official from afar and running for her life from the official’s backup. The woman is a spy for the French resistance in WWII, Virginia Hall, code name Artemis. She’s presented with her next mission: take intelligence to allied troops about the upcoming Normandy beach invasion. Shortly after, Maya shows up to assassinate her. The second segment, which apparently is going to follow along the first one throughout the series, is about Maya’s training in the organization and how she became what she is today.\n \nFrom what I had heard of Stephanie Phillips’s writing I confess that I maybe was a little too excited about this issue and forgot that it was a #1. However talented Phillips might be, and she sure displays quite the storytelling in this first chapter, there’s not much to be said about the plot just yet. This was a simple set up edition that serves to engage the story on the ones to come. One thing I can say for certain is that I was instantly captivated by each of the main characters. Maya is a hot head mess we’re all used to love and Artemis is a classic brave and noble, always willing to help others.\nThe art for this series gets the job done although I can say it wasn’t my favorite. There are two different artists, one for each segment of the comic. The first one is illustrated by Meghan Hetrick. The facial expressions carry a lot of detail yet I cannot tell why some panels seem to show the characters in a frozen state. I feel like it is a poor distribution of white of the eye and iris, which vary drastically depending on the expression, but that could be nitpicky from me. I liked Francesca Fantini’s work a little better. The facial expressions are a little more precise and organic making them feel more natural with the dialogue. In terms of backgrounds, I would say I’d invert my preference, since Hetrick’s backgrounds, despite not being as detailed as Fantini’s, carry more life and organic feel to them.\nDespite its few flaws, Artemis & The Assassin promises to be an interesting new series from Aftershock. If you’re interested in time-traveling agencies like I am, it is worth giving it a go in order to support the publication. But it also might be worth waiting on the next chapter to see how the story engages.\n","score":6.7},{"title":"Stealth #1","publisher":"Image Comics","writers":"Mike Costa","artists":"Nate Bellegarde & Tamra Bonvillain","date":"2020-03-18","body":"From the creative minds of Robert Kirkman and Marc Silvestri, a new superhero arrives to Image Comics! Needless to say it’ll not go as a standard super-story would normally, as it takes a dark and, frankly, nerve-racking turn right at the first issue.\nThe issue kicks off presenting us with a monologue about Detroit, the comics’ main location. Right away we get the impression that Detroit is to this person, what Gotham is to Batman. We get those dark and negative takes on most aspects of the city. We soon find out those are words written by our protagonist, Tony Barber, a journalist who is supposed to be writing a piece on an art fair in the city and not really about its many problems. Tony decides to go for a walk and, on the way out, meets his father, who clearly battles some sort of Alzheimer’s. We then cut away to our hero, Stealth, taking action against a burglar who is trying to steal from a laundry shop. Stealth takes care of the matter in a messy and expensive way, breaking the shop’s window in the process.\nMike Costa takes on the writing for this new series and it is easily one of the best aspects of it so far. The whole novelty of Stealth is the twist revealed at the end of the first chapter (which makes it weird that it was included in the synopsis, but ok I guess) and Costa dealt with said reveal in the most masterful of manners. Cutting, every time, from Tony, saying he’s going somewhere, to Stealth, inaction leads the reader to the most obvious conclusion. “Sure..”, I’d think while reading the chapter, “it’s expected but hey the motivations’ have been established and it’s cool”. Then, suddenly by the end of the chapter, we get a huge surprise (if you didn’t read the synopsis that is…). And one would think that it was the final page of the first issue, but Costa opted for making clear just how serious and dangerous the situation actually is.\nNate Bellegarde is responsible for the line art in this issue. One thing I noticed instantly is that the artist’s style wasn’t quite my cup of tea. The proportions between limbs, head, and torso look a bit off to me, but there’s nothing beyond that really. Despite my stylistic preferences I have to acknowledge the tremendous talent displayed by Bellegarde in this comic. Motion is incredibly well described not only with the well-known motion lines but with a varied use of particle trail (the particles describe the trail and the movement). The colors were assigned to Tamra Bonvillain and they complement the line art beautifully. Every single aspect of the highly detailed backgrounds are colored and it makes it especially impactful when the reader is able to tell the time of day with amazing precision just by the lighting and the shading.\nStealth presents yet a new twist to the superhero genre of comics and it does so with masterful storytelling created by an amazing team of artists who give this new vision all the charm it deserves. I really hope they downgrade the severity of the situation that was just set up right away and keep it as a defining character trait.\n","score":7.8},{"title":"","publisher":"The Crow: Lethe #1","writers":"IDW Publishing","artists":"Writer: Tim Seeley","date":"2020-03-08","body":" \nI’m going to be honest right from the start and say that I’ve never read any of the previous The Crow comic series. At first, I thought this made me unfit or unworthy of reviewing the first issue to this new iteration, since I don’t have so much background on the legend of The Crow. But then I discovered Tim Seeley was the writer and that he was very passionate about this project. I wanted to see what one of my favorite current writers had to put out on a popular character… And oh boy, does it look good!\nThe issue opens up with our undead protagonist of the time, Null Narcos, who is a performer with the Freak-Chic Sideshow since he is able to take violent and horrific damage without feeling any pain. During the performance, Null gets a flashback from what the reader can only assume was his life, before the crow came for him. The chapter then cuts to after the performance of the Circus, with all the performers gathering around a fire and having a few drinks. It is sad to see how comfortable Null has grown with his new life, struggling to discover his real name and yet, simultaneously, holding it back from himself.\nAs I’d hoped, Mr. Seeley’s writing is as good as ever. What I believe to be the author’s strongest suit is that he possesses an outstanding sense of pacing in a story, making situations escalate just as readers expect them to. He introduces the characters in a charming manner and then proceeds to introduce the elements of conflict (both internal and external to Narcos) only after the reader is captivated by the quirky set of artists that compose the Freak-Chic. All these elements make for a solid first issue to what should be an awesome Crow story.\nKyriazis’ artwork didn’t seem much to me at first, but once I started noticing how the artist opted for the peculiar panel disposition of some pages, and how those choices contributed to reflect the feel of the scene, I was mesmerized. Panels simulating slashes (when Null is performing, getting slashed) along with the flames in the background, all cut suddenly to a flashback it the confusion the protagonist feels is incredibly palpable. We get a similar scene in the antagonist introduction, but I’ll let the reader experience that first hand. Katrina Mae Hao’s coloring complements the line art amazingly! The usual shading and lighting are impressively precise, making a close-up to Null’s eye discreetly refract the flames. I liked how the artist managed to impose the moonlight on the circus camp, making the night feel comfortable despite all that ends up happening.\nThe Crow: Lethe is off to a great start! A solid introduction to the characters and to the protagonist’s mystery and counting with an obviously dedicated team of artists, this series should count for a wonderful addition to The Crow mythos.\n","score":7.8},{"title":"Finger Guns #1","publisher":"Vault Comics","writers":"Justin Richards","artists":"Val Halvorson & Rebecca Nalty","date":"2020-02-24","body":" \nOh, the times of teenage-hood everyone remembers fondly upon yet dread to the very fiber of their being. If only there was a way to keep our emotions in check during that time, in order to live a better and less stressful life. Well, the protagonists of Vault Comics’ Finger Guns are just like regular teenagers, they can’t really control what they feel. But controlling what others feel should be of some help.\nThe first issue opens with Wes, one of two protagonists in this story, going about his normal high schooler life. Right away the reader notices that Wes lives a very lonely life. No real friends and his father is never home due to work. Wes then playfully shoots a finger gun at a father dismissing his son’s claims, when he realizes the dad goes berserk and just throws his bags at the ground. After testing a bit, Wes discovers he can anger people with a finger gun. While fooling around with his newly discovered power, Wes meets Sadie, our other protagonist, who’s capable of cooling people off with a finger gun. She and Wes then gather to discuss their powers.\nHonestly, I don’t feel very comfortable reviewing Richards’ writing after only reading this first chapter. Mainly because there’s still barely any conflict, but also because it was all very standard for a first issue without losing the “teen discovers superpower” charm of it all, of course. That being said, the writer manages to get Wes’ solitary life across quite clearly while setting ground for character development since we can see Wes is not really in touch with his own emotions like most teenagers. Sadie, on the other hand, is charismatic since the very first moment she’s presented and seems to be way more mature than Wes on most accounts.\nHalvorson’s line art is charming to say the least. Going for a more cartoonish approach, the artist manages to make the most of minimalist panels. Face expressions don’t present much variety, although, to be fair, this whole issue was mostly people getting suddenly angry. I very much enjoyed how movement is portrayed, especially how sudden movements are obviously different from the gentler ones. However likable the line art is, what caught my attention was Nalty’s coloring. It inputs personality and atmosphere in a lot of panels who just lack a background altogether. That happens firstly in a “power test montage” at the city mall with a variety of colored backgrounds reflecting different emotions the character in the panel is showing. That helps contrast with the beginning of the comic, showing Wes’ boring little life, which just has basic and interesting elements in the background.\nFinger Guns #1, despite being quite standard for the first issue presents a promising start to a series with an interesting premise and great potential to hit top sales this year. The artwork is what did most for it, for now, but I’m sure the writing will bring itself up a notch in the next issues. This issue presents gorgeous art and is worth picking up for getting to know the characters.\n","score":7.5},{"title":"Money Shot #4","publisher":"Vault Comics","writers":"Tim Seeley & Sarah Beattie","artists":"Rebekah Isaacs & Kurt Michael Russell","date":"2020-02-07","body":"Yet another chapter of Vault Comics‘ Money Shot has just been released and it remains, easily, one of the most original and interesting comic books out right now.\nIn this issue, we go back to Earth a little to see how the gang’s adventures are being broadcast to the public. It’s easy to notice that the viewers at home have no idea of how serious the XXX-Plorers’s adventures have gotten since the first video was transmitted. Warlord Priest Daughir has achieved sovereignty after using the power of the Podna Megra to obliterate the rebel army and deprive Christine and Omar, captive by Daughir, of any hope of escaping. Except, maybe, for a clever intervention from Doug, Annie, Brie and the Bokai Elder who have not yet given up.\nSeeley and Beattie’s partnership has come as a beautiful surprise ever since the first issue and it just keeps delivering. Whenever the narrative starts to take a more serious tone some joke or sexual element comes up. The genius of it is that it doesn’t obscure any of the other comic’s aspects. In fact, it mixes up perfectly just like any other kind of element would since, well, it’s just sex. This is something this title has done incredibly well since the start, and it is talking about porn and sex normally, without treating it with secrecy or immaturity at all.\nIsaacs’ drawings and character designs continue to amaze this reviewer as she mixes an Orca whale with a wolf and puts a squid-like creature, such as Warlord Priest Daughir, in a suit of armor made of what certainly are bones of another species in the same planet. Not only that, but she succeeds at making the move in the characters extremely clear in a huge variety of ways, making me giggle as I go back and take the genius in. Russell’s coloring complements said genius equally with a consistent palette for the planet and its backgrounds and many different colors for the wide range of lighting and shade that the comic brings up along its way.\nOnce I dove into Money Shot I was expecting a light sci-fi set up with a lot of sex jokes and a plot focusing on comedy. Instead, I got a gripping plot about scientists doing what it takes to keep their research going, and exploring a fascinating theme in an extraordinary way! I love Money Shot and I could not recommend it enough to any comic book reader out there.\n","score":9.5},{"title":"Dr. Strange #2","publisher":"Marvel Comics","writers":"Mark Waid","artists":"Kev Walker & Java Tartaglia","date":"2020-01-30","body":" \nDoctor Stephen Strange recovered his hands miraculously years after the accident that destroyed them. Now he decided to perform the difficult surgery he was so good at, being a part-time surgeon and a part-time sorcerer supreme. How well can that work?\nThe second issue picks up where the first one left off, with Stephen sinking into wrapped by a cinder block after The Wrecker left him to die. Strange manages to teleport to his magical forge and decides to create a new artifact to help him defeat the new magically-upgraded villain. Counterbalancing his sorcerer life, we then jump to Stephen performing a delicate surgery and dealing with his superhero enthusiastic assistant at the hospital. There, Strange meets none other than Anthony Ludgate (a.k.a Doctor Druid) who, as a psychiatrist, is now running the hospital.\nMark Waid’s new take on the character of Doctor Strange is starting off as charmingly as his last one (Doctor Strange (2018)). And that is why I’m still not so sure about this new one. The author’s last run presented a new take on Stephen’s life, as this one is doing, and it was going really well until things just started mixing up too much and becoming uninteresting in comparison to the novelty at the beginning. Despite that, Waid’s storytelling is still quite good. He’s able to present various situations in a decent and natural pace making it feel like a rushed day would in the life of a Neurosurgeon/Sorcerer Supreme.\nKev Walker’s work is still quite new but it’s plain to any comic book reader that it gets the job done. His action scenes are quite gripping in this chapter opting for less detailed background elements, such as smoke or bright light, in order to focus the reader’s attention. In contrast, he puts tons of detail in the scenes that take place at the hospital which helps establishing the tremendous rhythm difference in these two parts of Stephen’s new life, which I’m sure is a crucial element to this new run. A Doctor Strange colorist must be a wizard themselves and I liked Tartaglia’s coloring a lot! The way he put a lot of white into the magical elements and made the hospital scenes look more opaque and bland makes up for more of that contrast I already mentioned and it does so beautifully.\nDr. Strange still only has two issues out yet. As I mentioned before, I’m treading carefully about this new run before I see more of it. But that does not take the credit off this initial issues at all. Waid introduces another paradigm into Strange’s world and manages to use the ones he introduced before. The art team is incredibly competent and promises to bring a lot of cool visuals however this run may turn out. If you’re looking for a nice read and are a fan of Doctor Strange, you should give this issue a go.\n","score":8.0},{"title":"John Constantine: Hellblazer (2019-) #3","publisher":"DC Comics","writers":"Simon Spurrier","artists":"Aaron Campbell & Jordie Belaire","date":"2020-01-24","body":"The conclusion to John Constantine’s new title series was released and it finally shows just how well this comeback of Con Job can actually go.\nThe issue starts directly where the last one left off, with John dealing with the homeless man at Peckham Rye who turns out, is the source and responsible for all the murders that have been going on at the park. Constantine is then interrupted by Noah and other members of the Ri-Boys Gang who try to end the mayhem by shooting the homeless man in the head. Needless to say, things don’t go so well.\nSpurrier’s conduction of this first arc was sublime! Especially in what concerns the pacing of the story, there was a whole feel to it which reminded this reviewer of the old Hellblazer book. Everything was really laid out in a spectacular giving the mystery, and obviously the story arc, an incredibly decent conclusion sprinkled with humorous moments. There’s a specific section of this issue which was pure Hellblazer gold where John starts to set up his final move on the magic entity and it cuts to and from John taking the bus and arguing with the other passengers for ordinary… well, bus occurrences. And the fact that the scene makes sure the reader sees both the mundane and the smart type of John’s simultaneously was a brilliant move on the writing. Contributed hugely, especially in this issue, by the lettering (by Aditya Bidikar) which reflects the tone of dialogue perfectly.\nThe art for this chapter, having been made by the same pair of artists from the last two (Aaron Campbell and Jordie Belaire), has not surprised, in a good way. All the panels were beautifully composed. The line art showed another gorgeous set of realistic yet ethereal compositions along with the on-point coloring reflecting London’s dual atmosphere which was pretty damn effective on the scene I mentioned above. However there was another detail I preferred about the artwork in this issue, which was put in a scene where John cast some sort of shadow around him and Noah in order to hide them. The representation of this shadowy magic (hazy and dark) set an impressive contrast against the “angels” bright and warm streams of mystique.\nJohn Constantine: Hellblazer‘s first arc is concluded. It was a tremendously good one, to begin with. The cast of artists could not have been a better one since it feels, throughout all three issues which compose this arc, that all the members of this creative team made it together, in the same room with a passion for the project. Now it’s official: John Constantine is back and I, for one, cannot wait for more of his stories.\n","score":9.5},{"title":"Folklords #2","publisher":"BOOM Studios","writers":"Matt Kindt","artists":"Matt Smith & Chris O’Halloran","date":"2020-01-21","body":"In the second chapter of BOOM Studio‘s new take on the fantasy genre, the story starts to present conflict as Ansel and Archer venture into the forest on their quest to find the Folklords.\nThis issue starts off similar to the first one, with the dialogue boxes announcing “Once Upon a Time..” as usual in fantasy stories, but being immediately contradicted by what seems to be a different person writing the story (with lettering worthy of note by Jim Campbell). Archer, Ansel’s elf friend, shares his origin story as the two carry on their quest and decide to take the most challenging path every chance they get… since it’s a quest.\nThis issue displays Kindt’s knack for the comic book medium. Right away, with Archer’s backstory, we get a great example of the well known “show, don’t tell” trait which is the cornerstone principle of any visual-based medium. Not only that but the writer’s twist with Ansel’s visions of a modern world makes the reader question whether he’s so eager to go on a quest and help people, simply because he had a vision of a DnD session or is it because he’s genuinely adventurous on his own. Kindt also manages to further build Folklord‘s world mythology by introducing two new mysterious ladies and a new legend about the Weeping Wood Killer making this story richer by the page.\nMatt Smith’s style is as charming as it gets. I was surprised as how much it reminded me of Mike Mignola’s but with a clever twist of charisma, since we’re not dealing with the same cold and bureaucratic world (which composes Mignola’s famous work, Hellboy), but a new and fantastic universe with a young-adult perspective on it. Not only the characters have an oddly unique design (considering that it doesn’t go too far from the well-explored fantasy genre) but their facial expressions are incredibly telegraphic despite the artist’s rather minimalist style. The comic’s coloring stays nowhere behind the line-art. O’Halloran’s work brings the exact atmosphere intended by the writer and any reader will feel what they’re supposed to in each scene and contributes heavily to Smith’s simplistic backgrounds.\nFolklords was a great surprise for me this month since I had missed the release of the first issue and I hope it keeps on going strong because if this isn’t an excellent example of comic book (and innovative) storytelling, I don’t know what might be.\n \n","score":null},{"title":"The Clock #1","publisher":"Image Comics","writers":"Matt Hawkins","artists":"Colleen Doran & Bryan Valenza","date":"2020-01-07","body":" \nTop Cow‘s new series approaches what might happen if a new viral type of cancer began to spread across the entire planet threatening an extreme sudden drop in world population. Sadly the first issue is a bit confusing and ill paced.\nThe first chapter kicks off with the protagonist, Jack, a cancer researcher, in a field mission somewhere in Nigeria with the objective of understanding why this specific village hasn’t yet suffered from the new type of cancer he’s studying. The village is suddenly attacked and Jack, along with his father (who is an ambassador) and other colleagues fight the rebels off. The comic then cuts back to Washington D.C. where Jack’s wife has just passed from the same disease he’s trying to understand and is now left to raise his daughter alone.\nThis first iteration was not a great start for this series. The comic feels like it was composed in two different manners. In the first half of it, the writer and the artist appeared to be completely off-sync. The pace is completely rushed, jamming information without the proper introduction or detail and then, out of the blue, the Nigerian village is attacked and saved and… that’s it? What came to be of that situation remains unclear for the rest of the book. The second is the exact opposite. writer and artist compose harmonically to create some powerful panels which deserve the recognition for bringing the gravity of the situation portrayed in the plot of the comic.\nColleen Doran’s style may not be for my taste. The artist’s realistic approach made most of the panels feel extremely rigid and static even in the action scenes. Not to mention the facial expressions which feel cold and forced. This issue’s backgrounds are nothing to be much impressed about either. They contain a lot of detailing lines but only to define folds or wrinkles in cloths while the characters in the scene appear drawn rather simply. I believe the same problem which existed between the writer and the artist in the first half of the comic, also afflicted the artist and the colorist, Bryan Valenza. The colors evidently try to bring life to backgrounds and character but everything remains looking still and dull, unfortunately.\nThe Clock presented an incredibly interesting plot which although sadly it started with poor execution in its first chapter. There is, as I mentioned before, obvious potential, and I sincerely hope that the quality picks up in future issues.\n","score":5.7},{"title":"John Constantine: Hellblazer (2019-) #2","publisher":"DC Comics","writers":"Simon Spurrier","artists":"Aaron Campbell & Jordie Belaire","date":"2019-12-20","body":"In the second chapter of John Constantine’s new ongoing we get angels, tigers, clairvoyance using human flesh, gang violence, and William Blake references. Basically, a normal day in John Constantine’s life back in London.\nIn this issue, John is still trying to solve the angel problem at Peckham Rye Common for the Ri-Boys’ leader, K-Mag. Except now John is also trying to get the kid that was assigned to help him, Noah, out of the gang for good. This generates tension between John and K-Mag, but Con-job doesn’t let it get in the way… yet. Constantine also has the luck to meet a Sikh police officer, D.S. Dole, who appears to be protective of Noah, for mysterious reasons.\nSimon Spurrier continues to impress whilst writing a Hellblazer comic. Not only he nails the Constantine attitude we all know and love but also manages to set up John’s first plan to tackle the angel problem in the most legitimately Hellblazer manner. He intertwines a dream sequence with John getting back in action, skillfully unfolding what John is going through after what was set up in the Hellblazer prologue and in the latest issue of Books of Magic. Spurrier is also focusing on throwing little hints at the reader about what the key to the mystery may be, always following Constantine around to provide a biased and limited look into the story.\nThe line art and coloring for this book are an unbelievable combinations. Aaron Campbell’s lines are precise and describe a very consistent and detailed picture when the scene involves only humans and is well lit. But when the scene is darker and involves and a bunch of magical fog and creatures it gets hazy. Not in a bad way, don’t get me wrong. It infers the confusing and ethereal nature of the whole event but it is then that colorist Jordie Belaire steals the show. The colors compliment the ethereal line art perfectly creating a combination that suggests winds and movements in the most natural and organic of ways, making for a beautiful composition in each panel.\nThis second chapter has developed the mystery a bit further as well as set up John’s new “friendships” for something that should come down the line. It may feel something of a rehash of the last issue, but it makes sense since Constantine is still getting a grip of London nowadays and is handling a location-based situation. The next chapter is the finale of the first arc and from what I’ve learned of this creative team, it should be a ride.\n","score":7.8},{"title":"Dying is Easy #1","publisher":"IDW Publishing","writers":"Joe Hill","artists":"Martin Simmonds","date":"2019-12-11","body":"IDW‘s new title is about violence, stand-up comedy, ex-cops, and plagiarism. Plus it is written and illustrated by an incredible team of artists who promises to be an amazing team up for the ages. Basically what I’m saying is: I’m excited to see where this goes.\nThe comic opens with the protagonist,ex-cop turned comedian Syd Homes, performing his stand-up routine in a comedy club. After he’s done we get to meet his comedian adversary, Carl Dixon, as he taunts Syd whilst going up on stage for his own routine. It turns out that Carl has his comedy career going well, not because he’s talented but because he steals jokes and gets acquainted with producers. That enrages Syd and his friends provoking a direct conflict between Homes and Dixon.\nI have yet to read Joe Hill’s Locke and Key but from what I read in this first chapter it is easy to say that he’s got a knack for comics. He inserts a lot of exposition in Syd’s jokes taking an actual advantage of the comedy theme the story is about. The characters are smoothly introduced and the construction on Syd Homes’ past life as a police officer is charming and raises a lot of interesting questions, which makes sense seeing as this is only the first chapter.\nMartin Simmonds’ artwork has drawn my attention since I read Punks Not Dead and even though the art is as mesmerizing in this new comic as it was in the previous series, with strong lines grounding reality and vivid colors, there are some differences. For instance, there are no magical elements in this story (at least not yet) so we don’t get that gorgeous glow Simmonds does so well. Instead, the artist creates an involving atmosphere for the scene that takes place inside the comedy club. Outside the club, we still get colder tones but keeping the involvement I mentioned before.\nThe coloring for this chapter is spectacular, I’m thinking maybe even more than any of Simmonds’ previous works. The only downside is a quick fight scene we get around the end of the comic that I’m thinking it is supposed to look distorted but there are some punches that don’t appear to hit so, it barely looks like a fight at all.\nLike mentioned at the beginning of the review, I loved how well paired Simmonds’ style got with Hill’s storytelling and despite my regards about the fight scene, the plot and the art are more than enough to convince me to keep up with this comic and see just how wonderful and gritty it can get.\n","score":8.0},{"title":"Daredevil(2019-) #14","publisher":"Marvel Comics","writers":"Chip Zdarsky","artists":"Marco Checchetto, Francesco Mobili & Nolan Woodard","date":"2019-12-09","body":" \nYet another chapter of Daredevil is upon us and it is new and exciting whilst delivering us a good discussion about the law like any Matt Murdock-esque person would love.\nThis issue picks up pretty much where #13 left us, with Detective Cole North and Daredevil actually having a conversation over a cup of coffee. They have a serious discussion on what the law should be and its current state in Hell’s Kitchen. Cole North gets schooled on “the right thing to do” by yet another masked vigilante. We then cut to Wilson Fisk and get to see how he’s processing his new friends from New York’s richest are not as receptive as he’d expected.\nChip Zdarsky storytelling is, as usual, one of the finest we get to see these days in the comic industry. Not only he manages to sneak some of that snarky Zdarsky humor (please, notice me, Chip), but he also brings out forth the moral dilemma embedded in the superhero genre in the best Daredevil fashion. Zdarsky keeps the reader interested especially with the pacing of the story’s progression going from Daredevil, to Matt Murdock, to Cole North, to Fisk, to gang leaders and back again maintaining a good idea of what’s happening on all sides of the same amazing story.\nMarco Checchetto and Francesco Mobili took over the traces for this issue and it is stunning as ever. The team description of the human anatomy is wonderfully mixed with the style presented and make every page a bliss for the eyes. Not only that, but the way motion is presented is very elegant as well ranging from simply deforming a tie/strand of hair to blurring the character mid-movement in order to reflect speed.\nThe coloring for this chapter was done by Nolan Woodard and it is beautiful! The artist presents incredible consistency over his lighting on each scene but the choice “more mundane” color palettes for scenes that don’t involve masked characters versus the choice for eccentric ones for the scenes with Elektra and Daredevil highlight the contrast in Murdock’s dual life.\nEver since Zdarsky was announced for the Daredevil title, we got excited. This issue, which puts the writer along with a fantastic group of other artists lives up to that excitement fully. We have a good story, good conduction and great artwork to feast our eyes upon. Definitely worth picking up if you enjoy a good comic and even more if you consider yourself a Daredevil fan.\n","score":9.2},{"title":"John Constantine: Hellblazer (2019-) #1","publisher":"DC Comics","writers":"Simon Spurrier","artists":"Aaron Campbell & Jordie Bellaire","date":"2019-11-29","body":"After years of not being in an adult title of his own, our dear own Hellblazer is back at it in DC’s Black Label new series. As shown in a sort of #0 issue, released earlier this year, this new series will tie-in with the new Books of Magic title eventually. But for now, all we get is a good old John Constantine story.\nThe chapter picks up with John being thrown out of a pub for telling anti-royalist jokes. John is made by the place’s bouncer, Nat, who should be John’s new companion at least for this first arc. After that, Constantine is ambushed and forced to help the Ri-Boys, a criminal gang who needs to know what has been massacring its members in the Peckham Rye Park, where they conduct their business.\nSimon Spurrier did great work on this first issue. After years of not having John Constantine in his full character for an adult label, we finally got it and Spurrier was the one who delivered. The attitude along with the comebacks and self commentaries could satisfy any fan of Constantine. Not only he nailed the character but also the storytelling. The plot takes its time, every tiny element is carefully introduced to the right point in order to make this a paranormal mystery story and it is amazing.\nPencils in this issue were by Aaron Campbell who has a very characteristic style and brings out the best of London in wide panels. His close-ups are nothing to frown upon either. Campbell provides a lot of expression lines to characters’ faces and poses which easily contributes to a more cathartic reading experience.\nThe coloring is done by Jordie Bellaire and it complements the penciling spectacularly! Considering how many lines there are in Campbell’s work, that is a remarkable display of talent for the craft. The wide panel I mentioned before is made even more mesmerizing by Bellaire’s work. Plus the glow effect she put on some magical characters and even on London’s street lamps is wonderfully soothing and involving.\nComic readers and fans of Hellblazer from every corner of the Earth may rejoice. It is back and it is looking incredibly promising. Counting on a highly talented team, the title should bring up the quality standards back to Vertigo times and if that won’t convince you to pick up this new series, I don’t know what will.\n","score":9.2},{"title":"Money Shot #1","publisher":"Vault Comics","writers":"Tim Seeley & Sarah Beattie","artists":"Rebekah Isaacs & Kurt Michael Russell","date":"2019-10-23","body":" \nImagine that humans are able to make the first contact with an alien species. Imagine also that we’re invited to be part of an advanced and civilized universe. Except the aliens noticed all the war and greed going on down here so they went away. We were left alone. And space travel is not appealing anymore, hence making it very expensive.\nThis is the context given to the reader on the very first page of Money Shot #1. In that context, we meet the scientist Christine Ocampos, inventor of a teleportation device that allows for interplanetary travel. The only problem is Ocampos got the funding to her research canceled and has to found another way to keep it alive. She opts for a rather eccentric alternative and decides to explore new sexual fetishes among her scientist colleagues and other alien individuals.\nTim Seeley is easily one of my favorite writers nowadays. Not only he has a consistent style and sense of humor throughout his work but he’s got amazing skills with storytelling as well. This comic gets all that plus the experience and strong sexual commentary of comedy writer Sarah Beattie who co-writes what should be a hilarious sci-fi comic book.\nThis first chapter presents us with the general overview of the comic’s universe and its rules. We get a decent character introduction with snarky comments from each of them. Other than that the title also presents a precise comedic structure that should provide lots of laughs along the line.\nThe artwork doesn’t fall behind in quality. The drawings are by Rebekah Isaacs who has a notable style without affecting her character designs which are vast and varied. Body types of every kind, especially regarding the alien race we first get to see. Isaacs’ details are equally impressive, down to wrinkles in rubber gloves and tiny dark pores on a shaved head.\nKurt Michael Russell handles the coloring and it is gorgeous! Every environment is set incredibly accurately increasing the immersion factor of this title drastically. This surprised me because of how cartoonish Isaacs’ style is and yet the art team managed to combine forces perfectly.\nA talented team of writers, a talented team of artists and an extremely original plot and set of characters. Money Shot is a promising new release by Vault Comics and if you’re into comedy and science fiction, I cannot recommend this comic enough.\n","score":8.7},{"title":"Trees: Three Fates #2","publisher":"Image Comics","writers":"Warren Ellis","artists":"Jason Howard","date":"2019-10-15","body":"Image Comics drops another issue of its new mystery series which reminds the readers of a Stephen King-like story, but with an imminent Warren Ellis spice and twist to it. Along with Jason Howard, the series starts to take its direction in this second chapter.\nThis issue picks up where the last one left off with Klara leaving the train station, except this time we see it from her perspective, being unaware of the sinister discussion taken at the place she’d just been at. Klara heads off to meet Doctor Osin who was to perform the autopsy on the recently found dead body. On her way, Klara meets another of Toska’s peculiar characters who seem to dislike Osin and to know about some sort of unclear prophecy.\nHowever, Warren Ellis is conducting the story at a controlled pace. Each page handles a new perspective on Toska and its inhabitants. Everyone has a strong opinion about the others and about the town and it all comes into Sergeant Klara’s radar. What’s new in this issue is we get a little bit of background on both Klara and Sasha, Klara’s boyfriend/husband.\nWeirdly so, we still don’t get to discover much about the Trees themselves. Where did they come from? Why are they there? Are they responsible for the twist at the end of this very issue? I’m trusting Ellis, who is one of my favorite writers to give us a worthy and interesting explanation when the time comes since there’s a strong feeling of foreshadowing in a philosophical discussion taken place at the end of this chapter.\nThe artwork for this comic is charming, to say the least. Regarding character design, every one of them looks like your next-door neighbor, very grounded and yet unique in their own manner. The art contains some dashes along with most elements in every scene in order to provide a rather stylized and pleasant kind of shading. Another thing worth noting is the weird and unnatural landscapes that appear in this chapter (in the upcoming ones, I hope) which are mesmerizing, to put it mildly.\nAs the story goes so far, Trees: Three Fates may not interest every reader, but, as I mentioned before, I trust Ellis has some good cards up his sleeve which should be even more powerful with the artistic team involved in this project. I look forward to the next chapter!\n","score":8.0},{"title":"Doctor Doom (2019-) #1","publisher":"Marvel Comics","writers":"Christopher Cantwell","artists":"Salvador Larroca & Guru-eFX","date":"2019-10-12","body":"Struggling to be a good leader for his country (and the world if allowed), Victor von Doom will have to prove his opinions are more than a matter of ego while he’s framed for a massive terrorist attack. This is the plot of Marvel’s new ongoing title Doctor Doom, which takes an interesting approach towards the oh so knows supervillain.\nThe first chapter is present to kick things off. We’re explained in some detail what the Antlion is, its goal and especially Victor von Doom’s opinion of the project, being highly critical of it. Despite having good arguments, which are dismissed as jealousy, Doom is ignored by anyone involved with the project due to his background as dictator and criminal. However, Latverian warheads suddenly launch towards the moon and destroy the Antlion and kill thousands of people on it. Doom has no idea of what has happened as he’s just become world enemy number one, without actual fault this time.\nChristopher Cantwell writes the story for this new title and he’s done amazingly regarding the character of Victor von Doom who’s… charming? Cantwell managed to maintain an incredible consistency along with the comic with Doom’s behavior towards his subjects. Although being frequently cold and distant Doom expresses affinity in a different way. Once you take into consideration what questions he’s asking and why Doom sounds somewhat kind and personal. Beyond that, we also see a personal and introspective Victor who gets lost imagining a life that never was and how things could be better. Showing these different sides of such a regarded character makes wonders for character development, at least for this new series.\nThe tracing is done by Larroca and it tore my opinion a little bit. I adored the backgrounds of every scene as well as the attention to tiny details the artist gives to what are obviously costly objects in Doom’s estate. However, I dislike how Larroca portrays faces and anatomy. The proportions take a weird turn depending on the angle in which the character is shown and the expressions feel exaggerated and stiff. The coloring, by Guru-eFX, deserves no reprimand as the scenes have a great range of lighting and every single one of them is colored wonderfully as well as consistently.\nDespite not being a great fan of the artwork, the plot and characters have interested me deeply and I cannot wait for the next issue to come out. I also hope the series doesn’t extend itself beyond needed, feeling much more, at least for now, like a great mini-series instead of a new ongoing.\n","score":7.0},{"title":"White Trees #2","publisher":"Image Comics","writers":"Chip Zdarsky","artists":"Artists: Kris Anka & Matt Wilson","date":"2019-09-24","body":"Part two of the Zdarsky, Anka and Wilson’s miniseries is upon us and shows us readers as well as the entire community that we should hope for more team-ups like these in creator-owned comics so we can see their full potential.\nThis issue picks up with the main trio sneaking on a group of Trilonian soldiers in order to steal their uniforms and infiltrate the fortress to where Scotiar tracked their missing offspring. Krylos, however, still refuses to fight and the team ends up having to improvise… taking Krylos as their prisoner. Once inside the enemy’s outpost, the group finds out a dark and enraging secret.\nAs per usual, Zdarsky’s writing is pristine. Not only he makes every single character on the page feel interesting, but also progresses the story to a perfectly paced rhythm, unveiling the secrets as they become important rather than when they were actually discovered. This comic received one of the most precise and well-done conclusions I’ve ever seen. Not only because the ending was fitting to what had been set up until then, but because of how it was presented. Zdarsky divided the main story into two cores ever since the beginning and managed to end both of them in the same scene, which was such a good partnership between the creative team that it made this ending feel organic and effortless.\nAnka’s line art is amazing! Action scenes are incredibly well described as are every single emotion the characters feel. Not only that but the locations are established before the scenes actually carry on making for beautiful panels which reflect this world’s differences and similarities. The shading is also gorgeous and provides the perfect setup to be complemented by Matt Wilson’s notable coloring. Wonderful lighting in certain panels that require it and a lot of personalized storytelling obviously present in other ones showing just how versatile and talented Wilson is.\nWhite Trees was a quick and blessing breeze which came along as fast as it went away. Yet, it is easily one of the best fantasy comics of the year. Everything the team chose to do, they did it right. If you don’t like the story you’ll like the characters, if not that, the artwork. It’s a simple and entertaining plot done with tons of style and passions easily making this a must-read.\n","score":9.0},{"title":"","publisher":"Excellence #5","writers":"Image Comics","artists":"Writer: Brandon Thomas","date":"2019-09-18","body":" \nSpencer Dales continues to rise through the ranks of the Aegis whilst breaking every rule needed to accomplish his goal even though he’s not really sure what that actually is just yet.\nAfter their violent combat, Aaron remains under arrest while Spencer is staying at his grandmother’s place in order to avoid conflict with his father. Spencer is still to witness Aaron’s past memories and they’re starting to bother. So he sets off decided to recover Aaron’s wand so he can undo their disturbing mental connection. Meanwhile, Spencer’s father, Raymond, has put a tail on his son, Monique, and has broken the rules of the Aegis.\nBrandon Thomas conducts the story as well as he has ever since issue #1. Spencer’s narration serves a lot more to expose his feelings and indecisions than the elements of the plot itself. What impresses me the most is how he is able to make Spencer sound as resolute as he is angry and stupid. It reflects incredibly well, of course, when most of Spencer’s plans go awry.\nOne flaw I noticed was the fact that there was another Aegis vault’s infiltration yet we don’t get to see any of it until its climax. It may be because nothing happened until then or just because it was just like the last one. Anyhow it felt weird, although being consistent with the non-linear storytelling adopter ever since the first chapter.\nKhary Randolph’s traces are as beautiful as ever. Not only her facial expressions remains the best I’ve seen in comics to this date, capturing varied nuances in simples expression lines but her anatomy is also on point. Her action scenes are exciting, relying on speed lines as well as on drawing the characters differently as the movement progresses. The panels for this chapter were quite the ride. Ranging from diagonally displayed to reflect the falling of a character to overlapping elements from panel to panel which gave fluidity to the scene. To complement Randolph’s gorgeous and unique style, Emilio Lopez’s colors are the choice. His representation of glow is mesmerizingly realistic, giving the exact intensity and power the magic being used in the scene radiates dragging the reader inside that tension and conflict.\nExcellence continues to amaze this reviewer. Every chapter takes an unexpected turn and develops its characters a little more. I can’t wait to see where the plot is heading and I’m pretty confident is going to be excellent.\n \n","score":8.7},{"title":"Tommy Gun Wizards #1 & #2","publisher":"Dark Horse","writers":"Christian Ward","artists":"Sami Kivela, Christian Ward & Dee Cunnife","date":"2019-08-28","body":"Okay, so when I found out there was a comic from Dark Horse called Tommy Gun Wizards and that I was on the right schedule to be able to review it in advance, I leaped at it. It’s called Tommy Gun Wizards. It’s mobsters in 1930s with magic. What else could I ever want?\nThe story follows Eliot Ness and his team of Untouchables in the police force who are assigned to end the illegal Lick sales. In this world, the prohibition era in the US wasn’t about alcohol but about the consume of the substance called Lick, which gives its consumer magical abilities. And with that weird and beautiful combination, we have a whole new set of luxury, violent and secret elements that always come up in stories like these. On top of that, we can add the extra four pages at the end of both issues that explore the origin of the magic in Lick which is telling its story little by little.\nWard’s conduction of the story is pristine. Considering how many new elements he’s mixed with known and established ones he could’ve led with a straight-up exposition page explaining all the differences. But that would easily break the illusion for the reader and diminish the experience. What he does, instead, is adopt a drug discussion that has been present ever since the 1930’s if not earlier and use that to make clear what kind of impact the use and sales of Lick has had in the community in those times. By doing so, he also manages to introduce his main characters, the police officers, in a drug bust, alternating to a role-call later. This all immediately clarifies what Lick is, what it does and why it may be harmful to society. All that without losing the stories momentum.\nThe magic present is as awesome as the plot itself. That kind of magic that appears to have clear rules behind it, but those are flexible and varied enough so we can get many types of spells and enchantments.\nSuch a spectacular story couldn’t have bad art. The project just wouldn’t be approved. That is to say, the penciling and coloring in this book are mesmerizing. The facial expression reflects perfectly the characters’ feelings and thoughts as they should, without looking exaggerated in any matter. The page composition is used boldly to reflect the scenes’ theme and feel as well.\nThe colors used in Tommy Gun Wizards are equally as wonderful and vary even among similar elements (fire in an environment A in issue #1 has a different color than a fire in a different environment in issue #2). The lighting is accurate and emanates from the magical elements with such conviction it contributes to making the whole scene more believable, even though there’s a guy throwing fireballs in it.\nI loved this comic, from the plot to its characters and world construction. I hope it lasts for as long as the creative team needs it to because both issues were incredibly nice to read every single page of the way.\n","score":9.5},{"title":"Fairlady #5","publisher":"Image Comics","writers":"Brian Schirmer","artists":"Claudia Balboni, Marissa Louise & Lesley Atlansky","date":"2019-08-21","body":"This week we got the final issue of a gorgeous series that sadly met its ends far sooner than it deserved. Fairlady explored the mixture between two genres that don’t meet that often and it did so always keeping it interesting with beautiful artwork alongside compelling characters.\nIn this issue, Jenner teams up with another Fairman in order to find and save the life of a woman tied to the investigation we saw on issue #2. The case presents plenty of loose ends and Jenner refuses to believe that her recent cases have been a sort of play on her life. Throughout the issue, we see that Jenner is chasing/begin chased by a mysterious creature, the likes of which hadn’t shown up in the comic yet.\nAs per usual, Schirmer’s conducting of the mystery is sublime. He manages to reveal just the right amount of information every page without giving the ending away. In this issue especially, the writer focuses a lot of Jenner’s introspection not only on the case itself but also on her clear idea that she might very well be wrong about the whole thing and is just being paranoid. Not only that but Schirmer is able to develop the comic’s fantastic world (even though he is revisiting a previous location) as well as to work on some development for the new Fairman in a scene.\nFrom the start of the series, one could already see that it was going to be a feast for the eyes of every reader out there. Despite using similar panels quite often, you can always see that it was to focus work on some other aspect of the artwork. The facial expressions are highly effective in giving off the characters’ feels and thoughts. The motion effect, using blur along with some movement lines succeed in describing precisely the trajectory taken as well as the intensity of the movement.\nThe pages in this issue are composed in various ways making the read instigating at every turn and reflecting Jenner’s sensation accurately, be it confusion or powerlessness. The coloring in this issue remains as staggering as it was in all the others. Precise lighting present in each panel, once more, dragging the reader into the environment of the scene turning the read, even more, into a heck of a ride.\nFairlady departs from our lives far too early as it was just starting to outline its major plot. It was a beautiful project performed by a group of deeply talented artists who I’ll make sure to follow from this point on. For that, I can only thank them for giving us a small taste of what could’ve been.\n","score":9.0},{"title":"Mall #1","publisher":"Vault Comics","writers":"Writer: Gary Dauberman & Michael Moreci","artists":"Zak Hartong & Addison Duke","date":"2019-08-21","body":"Ok, so picture this: the world has ended. The last known remaining habitat for the human population is an old shopping mall. Inside, despite common assumptions, the inhabitants struggle with clan and gang wars besides every other social issue you might consider that rises from human greed. This is the world of Mall.\nRight off the bat, the first issue presents us with what happened to the world. Or at least what the main character, Andre Walker, knows about the end of the world. According to him, things just stopped working and chaos erupted. Then, humanity found itself trapped inside a shopping mall, believed by Andre to be paradise even in the “life that was”. The comic then cuts to a woman running away from two masked figures who are trying to steal her baby. We then find Andre knocked out in a room beside the dead body of Delmon Gold, the leader of the Mall. Andre then fights to get out of harms way until met with old acquaintances.\nMoreci writing is highly talented and skilled. Not only he knows the initial exposition is somewhat necessary but he manages to make it a brief introduction do Andre’s personality traits which are confirmed later in the chapter. Plus, he makes the best of said exposition by making it based on the character’s view of the world of the comic which isn’t necessarily the absolute truth. The progression of Andre’s misadventures has a precisely regulated pace, taking time to introduce new characters and concepts needed to follow the story more accurately. We understand a little more of how the society inside the Mall is organized and what kind of rules take place in its population day-to-day life and every new aspect presented makes the whole thing even more interesting and compelling.\nAlthough it may not fit every reader’s preference Hartong’s style is very intriguing. It reminds this reviewer of Frank Miller’s (maybe mixed with Umbrella Academy’s Gabriel Bá) drawing style but a lot more contained and stylized in its own matter. The poses and facial expressions raise humor when needed but without killing the tension of the moment they’re shown. Sometimes the drawing is highly detailed and shaded, other times it is minimalist and flat. There is a great dominance of warm colors over cold ones, especially in the opening sequence, where we’re getting the background on the world’s demise. It all sets the tone of an arid apocalypse deriving from global warming and a series of natural disasters that we all know very well from other franchises. It all varies in the orange spectrum except when the old mall store products are displayed which serve to compose beautiful panels as well as to remind us that this used to be a shopping center and not really a fortress for humanity to take a stand. One can only imagine what that will mean in the future.\nThis is a solid first issue. The writing presents us the world, as well as some main characters and the artwork, makes the reading compelling though it might not to that to everyone. Despite that, the creative team appears to have a good alignment of what this project is about and is delivering precisely what was intended which, for me, looks incredible!\n","score":8.0},{"title":"Punk Mambo #5","publisher":"Valiant Entertainment","writers":"Cullen Bunn","artists":"Adam Gorham & José Villarrubia","date":"2019-08-17","body":"We reach the end of the story of the most rebellious sorcerer to come out of London ever since John Constantine and this chapter has Punk written all over it.\nThis chapter starts off with getting rid of Renaud, Azaire’s priest to be. Therefore it is only Punk Mambo and Josef going straight into combat against Azaire, now possessing the power of all the Loa, and Uncle Gunnysack who’s still around in another person’s body. Punk believes to have the upper hand in this fight since she’s used to magic but she’s not counting on being pulled into Azaire void.\nCullen Bunn’s writing is my cup of tea. He doesn’t waste time with unnecessary moments and just keeps the action going AND manages to develop the character while he’s at it. Another thing I like about his writing is how he writes magic, and this issue doesn’t disappoint. He kicks off the comic by having Punk Mambo explain how the Loa possess human beings while showing her do the same to Renaud which was just a genius sequence. Later in the issue, he explores how emotions can be used to the magician’s advantage if they know about it. But the most interesting approach, which Bunn has kept throughout this comic is the difference between Punk Mambo’s and Josef’s magic. Bunn uses that discrepancy, in skill and complexity, to make it obvious, to the reader and to other characters, that Punk Mambo is much more experienced than she appears to be, fitting perfectly with her persona.\nAdam Gorham and José Villarrubia’s work has been amazing for the duration of this series but in this chapter the art team just let themselves go nuts! First of all, they do a wonderful job of making Azaire look like the scariest and most powerful creature on Earth (which is what he’s supposed to be) mainly basing his appearances on a deep contrast between darkness and the red light from his magic. Another sequence where the artwork is sublime takes place inside Azaire’s void. The environment is full of colors and shapes which clearly references Steve Ditko’s early stuff for Doctor Strange, though the Loa and Punk Mambo don’t look just one solid color (or just normal) they look faded and out of context, resembling that they don’t actually belong in that place.\nOverall, this was a fun series to read. Charismatic characters, exciting mystical action and a pinch of actual terror here and there. Punk Mambo ends with a tease for a sequel, however, in case it doesn’t get one, this was a great series on its own. It presents a quirky combination of ideology and mysticism while maintaining an interesting plot with a marvelous artwork all the way through the end.\n","score":8.8},{"title":"Manor Black #1","publisher":"Dark Horse Comics","writers":"Cullen Bunn & Brian Hurtt","artists":"Tyler Crook","date":"2019-07-31","body":"Dark Horse’s new series was just released and it is promising. Groups of ancient sorcerers clashing against one another, the dark forces and maybe even the police are to make the\nis comic an exciting read.\nWe’re introduced to the basic set up for the story in three different narratives, two of which alternate throughout the comic. First, we meet Ari, who is running away from someone/something along with a group of friends/family members until their car crashes. Investigating the crash are the town’s Sheriff and one of his deputies, Harvey. We also meet Roman Black, a powerful sorcerer who is due to naming the successor to his power, before it’s too late. However, none of his children seem fit for the responsibility.\nThe introduction of this story components is sublime and wonderfully crafted by the writing duo Bunn and Hurtt. They start with an exciting chase and mentions of rituals, totems and a creepy hooded figure masterfully teasing the reader with the magical elements but without bothering to explain every little thing just yet. They then conduct the story by alternating between the sheriff and Roman making it feel like their stories are different pieces in the same game. With the sheriff, we learn more about Ari’s car crash and how odd it was. We also learn how small the town is due to cleverly inserted hints concerning the town’s public service. Meanwhile, with Roman, we learn a little more about the magic in this comic and how the Black family deals with it along with the generations.\nThe art, since page one, is breathtaking. Not only the characters are extremely characteristic and their face expressions really well composed (and explored by the narrative), but the coloring also swept off my feet. Both penciling and coloring are done by Tyler Crook which only brings the quality of this art up! His watercolor-like style is beautifully explored in every single panel, displaying gradients and different kinds of lighting whenever suitable, making the comic feel much more organic.\nThis was a spectacular surprise in my pull list as I knew nothing of this comic before reading it and now I can’t get enough. I hope the title maintain it’s quality as it progresses because the story is deeply instigating and the magic in this world seems like a well-constructed one and that always puts a smile on this reviewer’s face.\n","score":8.3},{"title":"The Wicked + The Divine #44","publisher":"Image Comics","writers":"Kieron Gillen","artists":"Jamie McKelvie & Matt D. Wilson","date":"2019-07-23","body":"In a quick chapter, we’re prepared for the finale of the magic and wonder we were presented through The Wicked + The Divine. It is weird to see this series concluding at last, but it seems we’ll be getting a just and satisfying ending.\nIn the last issue, everyone’s figured out Ananke’s plan and decided to resign their divinity and accepted that they’re “gifted mortals”, except for Lucifer. She is still convinced that she can not be anyone else if not Lucifer, fallen angel, who cannot be saved. It is up to Laura, who is closest to Lucifer to try and save her. There’s also a conclusion for Minerva/Ananke as she dealt with by everyone.\nIn this chapter, Gillen appears to have focused on some rather superficial story elements to conclude. We get the ending for Minerva’s plot, to the pantheon’s deity and a pretty neat character development on Lucifer’s part. The issue is a very quick read since it’s very straight forward. Everything is settled swiftly in order to set up the next issue, which I believe will wrap the series beautifully. Other than that, Gillen’s writing is a delight to read as always. The author is able to fit comedy in a desperate moment and make it feel like everyone (characters and reader) needed that moment. He then manages to transition to an instigating end of the chapter which guarantees we’re gonna pick up the final issue.\nAs always, the art in this comic book is sublime on both penciling and coloring. McKelvie does a wonderful job with the facial expressions on this issue having them range from angry, to mad, to confused and then to sad on a single panel (with different characters). Many emotional reactions towards a single moment and yet they’re all really well represented and instantly comprehensible given the situation. There’s also very cool and creepy imagery in a throwback to the “ascending” scenes the characters had when they became gods. Except now is Laura who “descends” into hell to try and save Lucifer from herself. Just as usual, Wilson’s work complements the artwork fantastically. His lighting is spectacular as usual. There is a key moment with a lot of fire in this chapter (Laura’s descent, mentioned above) and Wilson just gives it the perfect gradient coloring, brightening up the panel elements as they get closer to the fire.\nThis chapter contains the resolution of many elements the series presented us, yet not quite satisfyingly. However, it wraps up nicely what needed to be finished in order to explore the pantheon’s future in the next issue. It’s been a fantastical ride from an amazing creative team and I’m quite certainly going to feel a bit sad when it concludes on the next issue.\n \n","score":8.3},{"title":"","publisher":"Loki #1","writers":"Marvel Comics","artists":"Writer: Daniel Kibblesmith","date":"2019-07-17","body":" \nThe War of the Realms is over. Asgard and the Avengers won and managed to maintain the nine realms safe once more. Loki turned out to be a great deal of help in defeating his father, ruler of the Frost Giants, King Laufey. With this, Loki became the rightful leader of Jotunheim. Marvel’s new title covers Loki and Thor’s stories as they both became kings at the same time.\nThe first issue serves as a set up for the main story arc. Loki is not fond of being a ruler full-period and leaves the throne unattended for a night out on Midgard, which is where the reader first meets him. He is then met by Thor who was summoned by a mysterious elderly figure (that resembles Thor himself). We get a brief Nightmare apparition although it serves much more for Loki to make a point to his brother rather than being an actual threat.\nThe story is conducted charmingly by Kibblesmith who does so with humor and wit, reflecting Loki’s main character traits nicely. Most of the dialogues are dominated by the trickster making for a fun read whenever he’s on the page. By the looks of it, Kibblesmith is planning a quite ominous story arc for Loki however it is unwise to assume this is certain. The author is, at least in this issue, writing in a comedic manner and the build-up of the gravity of this first arc may be used as a humor device (disguising something as dead serious but then showing it’s really nothing is very common nowadays).\nThe comic is Drawn by Oscar Bazaldua and he delivers. Although I’d rather see Bazaldua’s work on cover art, since it feels it’d be much more satisfying, the artist knows the medium well and executes beautifully in every panel, especially regarding his use of motion lines and shading. In this reviewers opinion the artist’s style make the elements in the foreground stick out too much (probably because of the thick outlining), which make some of them look like stickers in an unrelated background, but that’s just me being picky (there’s also a panel where Thor is missing his eye patch, those are the kind of things I notice, I’m sorry). Curiel’s coloring work is delightful. It complements Bazaldua’s art perfectly adding lighting elements as well as a glimmer on magical ones. Those, when well executed, are always a treat for the readers’ eyes.\nThe first chapter took unexpected turns after the tease we got on War of the Realms: Omega. It felt like the book would be more about Loki and his newly found right-hand man Drrf. Instead, we’re getting a tale of two brothers, each with his own kingdom, as they learn to rule together… or not. I could be wrong. In any case, if you’re a fan of recent iterations of Loki you can’t miss this story as it promises to deliver the best of the God of Lies along with gorgeous artwork.\n","score":6.7},{"title":"Reaver #1","publisher":"Image Comics","writers":"Justin Jordan","artists":"Rebekah Isaacs & Alex Guimaraes","date":"2019-07-10","body":"A group of misfits is sent off on a suicide mission aiming to undermine the intelligence of the opposite side on a war that’s raging on the fantastical country of Madaras. Image Comics‘ new title applies the misfit team formula to an astonishing new setting that should pick up the interest of most comic book readers.\nThe first chapter covers the set up for the group’s mission and the beloved role call we all love to read. Before all that, however, we get to see Ash and Breaker’s past in the war for Madaras. Ash, who appears as our leading character, is a turncoat who aids the imperials in the fight against his people. He was thrown in prison for deserting battle as his fellow soldiers were massacred by the Devil’s Son, Breaker. After that, we’re presented to Marris, the mastermind of the group’s mission, and his bodyguard, Thes. The group is recruited and is sent off to their mission.\nThe conduction of the characters’ introduction sequences are on point. Each one gets their own moment to display their first impression (to us, the readers, and to the other team members) as well as their chance to shine on a brief escape scene later on. In order to keep a serious tone regarding the politics of this comic’s universe, author Justin Jordan opted for not using mainly expositional panels, instead of displaying the information along with the book’s dialogues. Although this is a bit confusing at first, it pays off later on, after we understand which slurs and nicknames are used to name which of the people involved in the war, despite there being some of them not quite explicit just yet.\nRebekah Isaacs‘ facial expressions and body language are sublime. Not only they translate the characters’ feelings but also complement their personalities perfectly along with the dialogue. Plus her action scenes are elaborate to the right point where we understand what’s happening and we are entertained. Guimaraes’ coloring is just as beautiful as Isaacs’ penciling. Although his shading is gorgeous and incredibly well made, it’s the lighting that caught my eye. The artist manages to include different sources of light in what appears to be an effortless work, as each scene is perfectly composed even if the light source is odd colored, such as bright pink.\nThis series is off to a great start. It combines elements that we know such as a political struggle in a fantastic world as well as the expendable misfit team we all love, yet it adds new elements and its own spin on just how weird these characters are. There’s still a lot to explore in the main group as well as in the comic’s universe making this chapter a must read set up for what’s to come.\n","score":8.0},{"title":"Test #1","publisher":"Vault Comics","writers":"Christopher Sebela","artists":"Jen Hickman & Harry Saxson","date":"2019-07-04","body":"Aleph Null is an orphan who undergoes medical tests for a living and to support their addiction to futuristic gadgets. Aleph is a body-hacker and possesses various modifications and implants in their own body. Check out the review for Vault‘s new sci-fi thriller.\nWe pick up with Aleph hitchhiking to the middle of nowhere, which they consider “perfect”. Right off the bat, they seem a bit eccentric. Asking the trucker very personal questions, which really serve to reflect what sort of thoughts go through Aleph’s mind. Null proceeds on their quest to find a town called Laurelwood. A Midwestern town, which disappeared from maps suddenly and is allegedly test-marketing the future. The perfect place for a future junkie to live.\nSebela’s work is solid. Despite never reading any of his writing it is quickly noticeable that he’s familiarized with the comic book medium. Keeping most of the storytelling to inner dialogues (or dialogues with a sort of personal assistant) and to flashbacks, Sebela exposes a lot of initial elements to the story but does so in a regular pace and with style. The exposition is mostly focused on Aleph’s past and what took them to this point of the story. Aleph’s comments on Laurelwood itself work as an introduction to the legend of the town but not necessarily to what it actually is, as shown in the final panel of this first issue.\nThis issue alone shows a lot of Jen Hickman’s abilities and art style containing a large variety of backgrounds which aren’t overworked but aren’t dead either. They reflect the importance of what’s in the panel to Aleph, giving the reading great sense of immersion, especially in the establishing panel for Laurelwood. Complementing such variety, it’s incredible what Saxson’s color work does for this comic. This has to be the best tone setting through color I’ve seen this year so far. The colors are used to give the reader a sensation of extreme heat, soothing cold, comfort and a lot more.\nThe characters’ facial expressions are on point, very important in this kind of conspiracy mystery type of story. Aleph’s reaction and faces either show exactly what they’re feeling or complements their thoughts beautifully, displaying the reader with a complex character full of personality\nTest‘s first issue puts in a motion a new sci-fi story which should involve conspiracy, futuristic paraphernalia and fight off against establishment rules in an interesting remix of many familiar elements by a talented team.\n","score":7.7},{"title":"Punks Not Dead: London Calling #5","publisher":"IDW Publishing","writers":"David Barnett","artists":"Martin Simmonds","date":"2019-06-30","body":"The final issue of Fergie and Sid’s paranormal tale is at last here! It involves tons of colorful magic, heartbreak and, clearly, punk rock.\nIn this awesome conclusion of Punks Not Dead second and final arc, we have a lot going on. We start off in a reality show similar to those that Fergie’s mom, Julie, used to act on. Such similarity made us think that Fergie might have, somehow, rewinded time, in the last issue. In fact, Fergie constructed the scenario and brought all the people it should involve into it, including the show’s host. There Dorothy Culpepper devises a plan to take down Fergie’s father, Beleth a.k.a Billy, using Asif’s spirit jaguar guardian. As the plan develops things go south and reality shifts over and over. It’s a packed chapter.\nDespite the great amount of events taking place in this single and final issue, Barnett’s writing makes it seem natural and fluid according the magic presented until this point. The dialogues remain deeply characteristic to each and every character which just contributes even more to the organic feel embedded deep in the storytelling. To add to that feeling Barnett filled the reality show segment of the comic with different corny taglines (such as ‘Sid getting vicious!’) depending on the characters’ reactions throughout the show and it makes the read hilarious and truthful to the Reality show genre. Barnett’s conclusion to the story is equally well written incorporating Fergie’s punk side in a incredibly satisfactory ending.\nThe art for this issue, as well as the whole series, is stunning! Right on the first few pages we get wonderful colored panels that pick up the reader’s interest immediately and from there on out it just gets better. Every shade, every stream of light every color in the pallet fits the composition beautifully with a neon tone that brings out the mystic elements in the story.\nAnother trace worth noting is the way every page is assembled differently than the one before it. Some of the pages follow the common composition of 4-6 panels juxtaposition to tell the story in a sequence. Yet, most of the pages play around with that aspect of comic book storytelling in an extraordinary approach. Page after page of quirky positioning of the panels give the story a different but instigating flow to it which just complements the writing perfectly. Plus Simmons’ artwork is just breathtaking and uses large spaces in the quirky pages to compose breathtaking pieces of art to fill the panels.\nAlthough I did think the ending was fitting considering the direction the story’s taken, it is predictable that many readers may not think the same way. There’s a lot that’s deconstructed in the last pages, but, at least for this reviewer, it doesn’t feel rushed. It’s all been coming to this point the difference is it actually happened, there’s no sudden twist or change. The story flows as it should. Though some may find that a bit dull I think it’s just what such a good story as this one deserves.\n","score":8.3},{"title":"Meet the Skrulls #5","publisher":"Marvel Comics","writers":"Robbie Thompson","artists":"Niko Henrichon & Laurent Grossat","date":"2019-06-05","body":"This month we got the final issue of Marvel‘s miniseries spy mystery/family drama involving skrulls, teenage angst and, for this issue especially, shape-shifting action.\nIn the conclusion, the Warner women, Gloria, Madison, Alice, and Ivy, are headed for a safe house hoping to meet Carl, the father, after they got separated at Project Blossom’s headquarters in the last issue. However, Alice sneaks off in the very first form we ever saw her change into, a butterfly, in order to complete her mission once and for all. I don’t want to say more so I don’t spoil the issue.\nThompson’s writing for this miniseries remained perfect and fresh for the crazy mix of genres he came up with. Not once relying on plain exposition dialogue or thought boxes and always keeping the flow of the story constant and interesting both on the family and on the espionage dimension of the comic. Every single one of the characters evolved in a believable manner making the Warners the most relatable skrull group in Marvel history.\nWhat can I say about Henrichon’s work? He kept the deeply detailed design traits for every skrull character constant throughout the series and has done an incredible coloring work as well, with Grossat’s assistance. In this month’s release, the action gains more space than on the other ones mainly because it’s a fight among two skrulls. This fight escalates slowly, starting with an attempted poisoning and ending after both skrulls let their shape-shifting do the fighting. It is an incredible and creative combat sequence complemented by a precise description of the characters’ movements, using motion lines, as it goes. The lighting for this chapter is also noteworthy as most scenes take place in darkened places and the partial lighting is presented beautifully and believable.\nThe conclusion for Meet the Skrulls is an outstanding wrap-up of everything that was constructed over the five issues of the series and, as a gift, Thompson gave Marvel a new set of already beautifully developed characters to work on. To anyone who hasn’t picked up this series, this is the moment I tell you to do it and guarantee you won’t regret it. After having read the Secret Invasion event back in 2009, I say confidently that Meet the Skrulls, as its title suggests is, at last, a proper introduction to the culture and the struggle of this classic Marvel alien race.\n","score":10.0},{"title":"","publisher":"Punk Mambo #2","writers":"Valiant Entertainment","artists":"Writer: Cullen Bunn","date":"2019-05-29","body":" \nPunk Mambo is a British girl who doesn’t age. She’s also a voodoo priestess. She’s currently looking for her pet spirit who got taken away from her in a weird way. Also, there are spirit snakes in this comic.\nIn this second issue, Mambo is still in Haiti trying to understand how her pet Loa, Ayesan, was taken from her when the Voodoo Gods contact and summon her for a mission. Turns out there’s another Loa, Uncle Gunnysack, who is abducting other entities in service of an unknown master. It is up to Punk Mambo, the spirit of Marie Laveau and the gods’ Houngan, Josef, to do what even the gods are afraid of doing and find Uncle Gunnysack to get to his master.\nCullen Bunn’s storytelling is ideal in this comic. In both issues we’ve had so far he was able to fit in just the right amount of story progression among exciting action scenes and amazing character exploration of Punk Mambo. In the first issue, there is a little exposition in the protagonist’s thought boxes but in this one there is no such thing. The dialogues are fluid, natural and impressively consistent to what we learned of Punk Mambo’s character. She’s, essentially, John Constantine with his cockiness turned to one thousand. The main difference between John and the first character in years to achieve his level of charisma in a magical story is that the Mambo actually stands up for her unmeasured words and leaps into action whenever needed.\nAdam Gorham’s work is mesmerizing. The first issue was already a treat to the eyes but this one opens with the six voodoo gods standing above Mambo. Each of their designs instantly memorable for being all quite different from one another and yet harmonizing on the same page naturally. The art team also succeeds beautifully in the representation of magic. Choosing different colored ‘filters’ over the pages which show an illusion while also going for simpler portrayals such as Mambo’s glowing eyes and light spear. Each of those makes for a gorgeous panel as well as establishing how the magic system works in this comic book.\nPunk Mambo is a classic if I’ve ever read one. The storytelling flows organically and is complemented perfectly with the artwork. I look forward to every issue to find out more about Victoria’s past and about this wonderful world the creative team is composing.\n","score":9.3},{"title":"Doctor Strange #14","publisher":"Marvel Comics","writers":"Writer: Mark Waid & Barry Kitson","artists":"Barry Kitson & Brian Reber","date":"2019-05-22","body":"Stephen Strange’s galactic adventures take an unexpected turn as his encounter with Galactus led him back to visit the magical realms he’s so used to and brought back his ex-wife, Clea.\nIn this month’s issue, Stephen continues his quest as the herald of Galactus, looking for a planet full of energy to sustain the cosmic giant but without sentient life. Meanwhile, Clea looks to contains Galactus’ hunger reasoning with him about Umar’s efforts to create a great magical alliance to transport Galactus back to his realm. The plot thickens once Dormammu’s reveal his own plan and allies.\nAs much as I like Mark Waid’s writing, the current story arc for Doctor Strange has made me feel like there’s little effort put in it. Since the last arc, with the accountant character, had already let me down for deviating from the cosmic approach Waid took at the beginning of his run, Galactus’ arc caught my interest. Sure, it turned out that Strange is, yet again, not in a cosmic domain, but the revival of the classic characters such as Clea and Umar kept my interest alive. Anyhow, the conducting of the storyline seems off. The alien sorcerer that banished Galactus has disappeared completely while another character has been suddenly introduced into the plot out of nowhere. The whole thing just feels like a collection of pitches from Kitson and Waid to one another rather than an actual script. Despite all that, the developments that weren’t introduced as an out-of-place plot-twist have reignited the story, regarding a review of Galactus’ character and Stephen’s love life.\nKitson’s art style is a treat for every Ditko and Kirby fan. The artist provides his own take on the crazy and psychedelic magic realms that the greats established years ago. Providing the readers with beautiful pages composed of a magically altered Galactus alongside weirdly designed creatures for every realm that is explored. Every large scale character and environment is drawn with astounding levels of details which accompanied by colors bring this comic to life as the story gets weirder and weirder.\nI love the mystic universe surrounding Doctor Strange as much as I love the characters in it. I’m hoping the following issues resolve this arc in a compelling fashion since it started off great. Besides that this run is still worth the read for the art in it and the entertaining reintroduction of classic characters.\n \n","score":7.7},{"title":"Fairlady #2","publisher":"Image Comics","writers":"Brian Schirmer","artists":" Claudia Balboni & Marissa Louise","date":"2019-05-15","body":"After posing as a man to fight in the war, Jenner Faulds returns home, The Feld, and becomes a Fairman, a licensed private investigator. Being the only Fairlady, Jenner gets the cases none of the other Fairmen will take. Along with her partner Oanu. Image Comics’ new series gives us detective stories within a fantastical universe and it is looking quite promising.\nThis issue covers yet another of Jenner’s cases. This time she ends up being hired by the widow of a fellow Fairman to investigate and prove that her husband didn’t die by the flames of a dragon, as it was told her. The protagonist then heads to question The Feld’s other Fairmen and constabulary in order to get to the bottom of this mystery.\nSchirmer’s writing of a private investigator and the mysteries they investigate is on point. As a huge fan of those, I’m deeply glad the series is going for the single-issue cases rather than extending them throughout whole story arcs. Despite Schirmer’s ability showing that would work well also, I believe the current approach is better especially for these first few issues which count more for world building and character development. We do get tiny hints of the protagonist’s past and the war but the comic never deviates too far from the current case, keeping Jenner Faulds’ character as obscure and instigating as the best detective novel would.\nThe comic’s backgrounds mostly don’t show up whenever we’re supposed to be absorbed by character’s dialogue (only a general background color is shown). But when they do they’re composed purely by jaw-dropping sceneries. The level of detail applied to those is stunning and they drag the reader inside the comic by establishing an amazing atmosphere. Louise’s color work complements Balboni’s traces as if they’re supposed to be put together. The lighting in this series is perfectly crafted as the colors contribute to the atmosphere mentioned above. The colorist’s work also gives the characters’ clothing wrinkles and textures. Although the series hasn’t focused much on action scenes yet, I’m confident when it does the scenes will be sublime. I think that because the art team makes the effort to portray action and motion in a very convincing and charming way. Sudden and violent movements (punches or flying projectiles) are shown with big groups of speed lines while gracious ones (wind on hair and clothes) are portrayed with static images but always in a convincingly consistent form, composing beautiful panels when they happen.\nFantasy elements combined with greatly written mystery cases accompanied by gorgeous visuals. These are the main components of both Fairlady issues released so far, meaning I’m gonna pick up the next one with huge enthusiasm and I recommend this immensely to anyone who likes detective stories.\n","score":9.5},{"title":"Eve Stranger #1","publisher":"IDW Publishing","writers":"David Barnett","artists":"Philip Bond & Eva de la Cruz","date":"2019-05-07","body":"Imagine you wake up in a luxury hotel room. No memory whatsoever of how you got there or even who you are. Your only clue is a letter left behind by yourself. Suddenly you have to start doing some crazy stuff and turns out you’re actually quite good at it. That’s the plot for Eve Stranger, new series from IDW’s publishing Black Crown.\nThe issue follows Eve Stranger, the protagonist, as she wakes up with her memory wiped. She starts to read a letter she wrote to herself explaining the situation. Someone attempts to murder her, but she manages to restrain them and call the police. Yet, when they arrive, there’s no one to be seen. She then tries to get her blood tested for a possible drug that might be in her system, only to realize there’s something more extraordinary in it. It’s also made clear that this is all routine to Eve. After that, she appears to come to terms with her life as it doesn’t seem that bad to have unlimited bank credit and kick-ass abilities and carries the mission that was left for her in an envelope. This chapter also introduces us to the E.V.E Project which seems to be Eve’s contractor and the project’s competition.\nDavid Barnett’s writing is a treasure and this issue contributes to that feeling. He conducts the narration through Eve’s letter in dialogue boxes. That makes the narration close and personal to the protagonist and makes the reader relate to her in a heartbeat. Eve is shown to be a nice and gentle person despite her profession and daily life. Barnett also escapes the established narration naturally in order to expose the other pieces on the board (E.V.E. Project and competitors).\nPhilip Bond’s artwork, for this reviewer, reflects perfectly the character established by Barnett. A charming and adorable aspect to it in the heartwarming scenes and yet also realistic and aggressive when violence comes to play. Eva de la Cruz’ colors give Bond’s work an amazing compliment. Providing realistic lighting to every scene, la Cruz’ work sets the tone of what’s happening instantly being it either a childhood memory, which feels warm and comfortable or a one-woman raid in a warehouse full of armed man, using red to change the environment whenever shots are fired.\nEve Stranger #1 engages the action-filled story it promises to be. Taking it’s time to present all the elements in a charismatic manner this comic should be yet another great title by an incredibly creative and resourceful group of artists.\n","score":8.7},{"title":"Excellence #1","publisher":"Image Comics","writers":"Brandon Thomas","artists":"Khary Randolph & Emilio Lopez","date":"2019-05-07","body":"Excellence is the new fantastic story by Image Comics which presents something different.  It tells the story of a secret magical society, but unlike Millar’s The Magic Order,  this series promises to be deeply emotional and involving right off the bat, packed with tons of action.\nThe issue follows the origin of Spencer Dales, the series’ protagonist. We see Spencer being born and learning the magic ways of his father’s family from the early age of four. Raymond, his father, is a member of the Aegis, a secret society of magicians who are sworn to better the lives of those with great potential but never their own.\nWe then see Spencer overcoming the pressure his father lays upon him and his difficult relationships among his colleagues since he’s lagging behind. Despite all that Spencer stands strong with the support of his grandmother who encourages him to break a few rules in order to accomplish his mission as a member of the Aegis.\nThe first issue of the series already displays some talented writing by Brandon Thomas. He introduces the many concepts around the comic’s universe without relying heavily on the same brand of exposition every time, otherwise, this whole issue would be dull and full of info-graphics. At the same time, the writer manages to carry Spencer’s origin story with an ideal pace as the age progress is shown, page by page, alongside the character’s inner dialogue which exposes how he feels and reacts facing this set of rules which is forced upon him.\nArtist Khary Randolph amazes any reader presenting creative character designs which mix urban and fantastic beautifully making this a believable look for a group of secret magicians in our modern days. The artist’s facial expressions and facial traces, in general, compose a detailed, but stylized, portrait of every single character, including the minor ones. The magic in Excellence is presented mostly in a straight forward fashion with lightning bolts and odd-colored flames. Despite that simplicity in shape, Emilio Lopez’ coloring brings out the magic in the magical elements. He gives them a type of trademark color for each character, to keep the reader on track of what exactly is going on. Lopez also provides marvelous lighting on every scene, which reflect precisely the feel of said scene.\nExcellence shows right away what it came for: excellence. Exciting action, compelling characters, and an involving plot, this series is definitely worth picking up as a beautiful new gem available for us comic book readers.\n","score":9.5},{"title":"Descendent #1","publisher":"AfterShock Comics","writers":"Stephanie Phillips","artists":"Artists: Evgeniy Bornyakov & Lauren Affe","date":"2019-05-07","body":"“Conspiracy theories, government corruption, and a really good mix of Prince…”. This is the initial description of AfterShock’s new mystery series. Despite me expecting a very straight forward kind of story this is not what we get at all and that’s for the best.\n\nIn the first chapter, we get a tiny glimpse into the mystery that’s about to unfold as babies from famous politicians start getting kidnapped out of the blue with the similarity being a weird symbol left on both scenes. The protagonist, David Corey, is a conspiracy theorist who is on to the kidnappings since he believes they’re connected to the Lindbergh one, which brought attention to the same symbol. Along with the issue, we get to know David’s ex-wife and attorney, Amanda Mansfield, who clearly has some problems with Corey’s theories yet finds it hard to disbelief them. There are also two detectives involved who apparently will be the police core of the story which always brings a lot to a mystery tale.\nStephanie Phillips’ writing is new to me, but nothing felt out of place. According to the series’ synopsis, the story will escalate plenty as it progresses, and yet, the writer managed to give it a paced and mannered introduction. Although I would love to have an idea of just how big the mystery can get, the secrecy of it is what will keep me reading this at the edge of my metaphorical seat. The comic has an X-Files feel to it but with more chemistry among the main characters, since they share a past, which only makes the read even more enjoyable and fluid.\nEvgeniy Bornyakov’s art is a comic book treasure. Facial expressions are on point as are the character’s poses. The artwork is kept on a balance point between realistic and stylized making it a beautiful book without getting too tiresome. Bornyakov complements Phillips’ cinematographic style of storytelling beautifully, representing each panel exactly as the writer intended for dramatic effect. The color of this book is equally amazing. Lauren Affe gives the comic impeccably detailed shading contributing to the realism mentioned above and the choice of opaque color tones serve to point that, as the mystery unfolds, everything still looks normal.\nDescendent #1 is an interesting start to a true mystery filled comic book, first I’ve ever come to read. I expected an insight on both sides of the mystery right away but realized I didn’t know what I wanted as the talented creative team showed me, playing their cards close to their chest. The readers will get to see the case develop along with the characters which make for a thrilling read of an investigative story.\n","score":8.7},{"title":"Outer Darkness #6","publisher":"Image Comics","writers":"John Layman","artists":"Artist: Afu Chan","date":"2019-04-09","body":"With the sixth chapter of this new amazing series, we get the finale to the first story arc and it is quite a ride. In this issue, the crew of the starship Charon is still stranded on an icy planet, having to deal with a demon aboard what’s left of the ship and a possessed crew member, Sato Shin, trying to lure the others towards their death. Despite the focus of issue #5 being the crash and Shin’s double-cross on the crew, this chapter focused more on the demon released on the Charon and it’s fighting against Cpt. Rigg and his team of exorcists with lots of action.\nDespite loving how the action took place in this issue, I thought the dialogues were a bit off. What is discussed in them is fine and plausible, Administrator Prakash informing captain Rigg of Shin’s suspicious actions, but John Layman attempts at keeping Cpt. Rigg’s lines witty all the time, which worked for the last issues, felt a bit forced in a situation as dire as the one in this chapter. There’s also a quick joke sequence where Cpt. Rigg displays, once more, his dislike for cats, yet unexplained.\nOther than that, I have to recognize that this comic contains unbelievably well-composed action scenes. Good pace, crystal clear on everything that’s happening and where every member of Rigg’s team is located during the conflict. Layman manages to keep the action going as he develops the execution of an organized combat strategy, avoiding unnecessary dialogues this time. The pivot of the comic’s focus form Shin’s evil plot to the demon on the ship was a welcome surprise, seeing that it saved Shin’s story as a clever setup for the next story arc and a development to First Officer Satalis’ character.\nAfu Chan’s artwork remains one of my favorites. In this issue he, yet again, displays an incredible ability to portray scary creatures, giving Sato Shin a demon form, and incredibly detailed gore elements that made me shiver as I read through the comic. The crystal clear action scenes are complemented by the artwork beautifully, utilizing many different techniques to indicate the characters’ movements, ranging from simple motion lines to trails of dust lifting from the ground.\nAnother aspect worth noticing, was the backgrounds, especially on the main action sequence. Those could have been composed mainly by the ship’s interior and a few zoom-line panels, but Chan added a spin to it, composing the background to the fight with mathematical formulas, which are supposed to be the protection wards cast by the mathematicians, in a gorgeous orange gradient color scheme.\nThe last issue may have been a bit dull, but this one makes it clear that the creative team saved the best for last. Filled with action, gore and mathematical-magik this chapter makes for a great finale and makes me excited for the next one.\n","score":8.8},{"title":"Amber Blake #1","publisher":"IDW Publishing","writers":"Jade Lagardère","artists":"Artist: Butch Guice","date":"2019-04-03","body":"IDW’s new series, Amber Blake, is about the titular character showing herself a prodigy and drawing the attention of a big international school called Cleverland. There, Amber discovers the cruelty of the man who recruited her after being abused by him and witnessing two of his murders. On the run, Amber is then rescued by another organization, Argon, which acts, as the character herself puts it, as a “humanitarian MI6”. Argon recruits prodigies such as Amber in order to help make the world a better place. Although that plot transpires with amazing ideas and possible developments, it is sad to see how poorly it was delivered on its first issue.\nThis chapter covers the whole basic plot (described above) in one swing giving the read a weird and rushed pace. We get three-time skips in the first three pages of the comic! These present us with the first years of Amber after she was abandoned at the orphanage by her mother. Sure, we get a good idea of what happened in her life until she got to Cleverland, but if it only took a single page per skip, how actually necessary was those years to the comic’s plot? The rest of the book is dedicated to Amber figuring out just how criminal her recruiter, Mr. Kavotz, really is and having to run away from it all when confronted by him. This is the best segment in the book, yet, it’s still rushed with random information just dropping on the reader’s lap. The rest of the chapter covers how Amber was rescued and recruited by Argon also with terrible pace, this time accompanied by an unclear action scene, an awkward transition between each scene and a confusing hacking scene.\nThe artwork for the book is not bad. The backgrounds are composed beautifully, enriched with many tiny details which could take hours to absorb. Each of those is also wonderfully colored by Guice, providing the ideal lighting to reflect the tone of Amber’s situation in each scene. However, I believe that’s about it for Guice’s art. His facial expressions, despite very realistic, remind this reviewer too much of Greg Land’s work, who’s known for tracing poses and faces from famous actors’ mugshots, lacking in style and personality. Other than that, Guice still fails to provide involving action scenes. What happens in each panel is clear, but there are no movement lines or transition in between engagements whatsoever. We get the start and the finish, that’s it.\nThe plot for this series intrigued me, it really did. I adore Nikita and whatever comes in that style, which was pretty much what this title promised. I was excited to read the first chapter and to write a review about it. Unfortunately, it was a huge disappointment in both writing and artwork.\n","score":4.7},{"title":"Umbrella Academy: Hotel Oblivion #6","publisher":"Dark Horse Comics","writers":"Gerard Way","artists":"Artist: Gabriel Bá & Nick Filardi","date":"2019-03-26","body":"In the pre-finale to Umbrella Academy: Hotel Oblivion, from the same creative team that released the first two volumes, we get crazy amounts of action along with exciting artwork.\nIn this chapter, the Hargreeves meet each other at the hospital where Klaus was left by the mysterious figure from the last issue. There Klaus gets an ominous warning from his dead brother Ben. Most of the family band together to stop the super criminals from destroying the city. Allison is still chasing after the Murder Magician, who is also being chased by the mother of his yet unexplained baby. Vanya is shown to have been taken to Norway by last issues mysterious (yes, again) lady.\nGerard Way’s writing is something to admire. Deviating from what most writers go for nowadays(character development and detailed exposition), Way bets on telling the story in a very straight forward manner. Despite bearing a somewhat complex fiction, Way writes Umbrella Academy mostly through short dialogues, superficial exposition and a lot of action. For this issue, he managed to keep alternating between the three main narratives in a precise chaotic pace, portraying the chaos of the whole situation.\nThis issue’s artwork looks spectacular, to say the least, combining pencils and colors beautifully! Bá’s work has been one of my favorites for a while now and it makes me so happy to see he still goes for a stylized art full of personality that fills the book with life. Bá represents the many escapees from Hotel Oblivion in many varied designs each with its own brand. The artist is able to show various facial expressions without too much detail on the character’s faces, betting on more detailed backgrounds instead. Filardi’s colors complement the pencils amazingly, providing a three-dimensional feeling to Bá’s mostly two-dimensional art, with shading for and even fading the color a bit off from the elements in the background.\nOne issue away from its final chapter, Umbrella Academy: Hotel Oblivion still has a lot to explain. Nonetheless, this is a beautiful looking book with sensational writing giving the fans of the Hargreeves family even more than what we already got in the previous issues. This issue specifically has delivered way more than what I’ve been expecting from this new volume and makes me excited for the finale, making it impossible, for this reviewer, to not grade this as a masterpiece.\n","score":10.0},{"title":"GLOW #1","publisher":"IDW Publishing","writers":"Tini Howard","artists":"Artist: Hannah Templer","date":"2019-03-26","body":"This week we get the first chapter to a 4-issue mini-series that spins out of the Netflix series GLOW providing fans of the show a catch up with the characters in a different and interesting way. The series will revolve around the Gorgeous Ladies of Wrestling attending the Reseda Wrestlefest and having to wrestle another group of female wrestlers.\nThe first issue introduces us to the story. The girls find out about Wrestlefest and from Sam who tells them they’re scheduled for an appearance… but they will have to pay their traveling fee themselves. We then get different short narratives of how the girls managed to raise the money in time for the trip. Those ranging from street performances to a peculiar bake sale.\nTini Howard’s writing takes off quite rapidly at the beginning of the issue with a bit of similarity to a cartoon episode plot, setting up the problem right away so that a few anecdotes about the fundraising can be shown. This chapter focused most on presenting the show’s characters in the comic book format and it does so nicely. Howard is able to capture the show’s humor spot on despite not being able to the same for the cast’s charisma, which unfortunately makes for a huge loss to the plot’s charm. Sure the characters are fun on their own, but the comic made clear that a lot of that comes from the cast members. The plot and how it flows feel like a cheerful episode from the show, avoiding the darker themes the series has already approached.\nTempler’s pencils alongside Nalty’s colors give the book a beautiful and lighthearted tone. Templer’s style is gleeful at its core and does an amazing job at giving the book a cartoonish look (with exaggerated facial expressions and movements that are hilarious) and still portray every actor and actress faithfully, making it easy to recognize each character from the show. Nalty’s choice of colors complements that style with warm pastel tones managing to make the artwork even more charming.\nThis first issue is a funny and entertaining read and it feels good to get a new story about GLOW’s lovely characters, but it merely scratched the TV series’ already displayed potential to present heartfelt and heavier storylines. Which is why I’m hoping Howard will drive the comic a bit darker in the next issues, seeing as most of the story arcs in the series also started off lightly\n","score":8.3},{"title":"Dark Red #1","publisher":"AfterShock Comics","writers":"Tim Seeley","artists":"Artist: Corin Howell","date":"2019-03-20","body":"This week we got the first issue of the series that promises to tell a different vampire story. Dark Red tells the story of Charles “Chip” Ipswich who works the last shift at a gas station in a country-side little town where people still have some outdated and prejudicial thoughts. Chip lives a dull and boring life, but things are about to be shaken up.\nThis issue presents us with some characters that might come up later in the story, focusing mostly on showing us how Chip lives his life. A life in which Chip counts with Evie Keen, who suffer from a medical condition which causes her to produce too much blood. That being, Chip and Evie help each other, her serving as a food source and him helping her to dispose of some of that extra blood. This chapter also presents a nameless woman, who is looking for our protagonist and feeding on citizens in the meantime.\nTim Seeley’s writing conducts the story smoothly, showing many of the complications that Chip faces in his day-to-day life as an undercover vampire. Those nuisances range from having to keep up with the thoughts and slang of present days to clocking out of his job on time so that he doesn’t get scorched by the sun on his way home. Seeley also succeeds in presenting both Chip and Evie with amazing depth considering that there is almost no exposition whatsoever. The writer relies on presenting those characters through a dialogue between the two of them about their daily blood sharing routine and the hypothesis of a life-changing decision serving to show how different these characters are despite their friendship.\nCorin Howell’s artwork does its job finely. The artist provides us with accurate facial expressions without relying on exaggeration. Her scared faces are as much convincing as are her worried and sad ones, all of those being portrayed incredibly focusing on small details on the character’s eyebrows and mouths. Plus her scary faces are also tremendously… well, scary! Sticking with the realistic approach portraying those faces as if the characters’ facial muscles are being pushed to their max. Howell’s main skill appears to be such unperceived details since she also applies them to the backgrounds making them feel realistic without being saturated. Howell’s characters designs are also noteworthy since every character’s appearance bears a different personality reflected in the writing perfectly.\nDark Red appears to be an exciting new series displaying great quality in both writing and artwork making for something that promises to be a thrilling read every issue.\n","score":8.0},{"title":"Outer Darkness #5","publisher":"Image Comics","writers":"John Layman","artists":"Artist: Afu Chan","date":"2019-03-12","body":"Outer Darkness is a space exploration comic book that narrates the life of reckless captain Joshua Rigg and his crew on board the starship Charon powered with a God-engine. The series takes place in a distant alternate future where magic and technology mix in harmony making it an intriguing new kind of space exploration plot.\nThis chapter first shows us a distant future with a horrible monster terrorizing a colony and then cuts back to where issue #4 left off, with an explosion aboard the ship. The Charon makes an emergency landing on an ice planet to attend to damages and injuries and that’s when things begin to get really messy with stress amidst the crew commanding officers and demonic possessions.\nDespite me enjoying this series so far this chapter didn’t please that much. On previous issues, we got clever introductions to characters and especially to this universe’s set of rules which were skillfully built into the script. We continue to get more of the amazing characters and weird science/magic, however, considering this issue was the first part to the first arc’s conclusion, I think a lot more could have happened, seeing we’re only presented with a crude set up. Sure the previous chapters presented us to the tiny pieces in the puzzle coming together, but this one doesn’t even give us a glimpse on that puzzle yet.\nAfu Chan’s artwork is one the best on comics these days easily. Extremely stylized without being fuzzy and confusing. Using hard sharp lines, he delivers beautiful compositions for every one of the panels. Chan’s character designs are unique, making use of different ethnicities, shapes, hairstyles and alien species (ranging from a simple cat-lady to draconian officer with a goatee) showing just how varied a set of characters in a sci-fi themed series can be. The monsters and horror scenes for the book don’t fall behind. Chan’s style seems to be quite friendly at first but delivers one of the best gore artwork I’ve ever seen along with scary and imaginative monster designs which instantly change the comic book’s tone whenever they’re shown.\nOuter Darkness is a fantastic series which has just released what could be its first dud. Maybe this month’s dull read is compensated by the next issue which concludes the comics’ first story arc and, who knows, shows that this issue’s lack of action was the best option to go for. Despite not enjoying this issue, I recommend picking this series as it is one of the most innovative comics being published at the moment.\n&lt;br /&gt;\n","score":7.8},{"title":"Gunning For Hits #3","publisher":"Image Comics","writers":"Jeff Rougvie","artists":"Artist: Moritat","date":"2019-03-12","body":"Martin Mills is a 80’s talent signer for a big American record company who hides a dark, possibly criminal, background. Image’s new series, Gunning For Hits, revolves around Mills, his past and his successful (at least until now) work on the music business.\nIn this chapter, Mills continues to try and sign one of his favorite singers, come-back star Brian Slade (clearly inspired on David Bowie), but Slade’s got his eyes on Martin’s latest discovery, the band Stunted Growth, for some reason. We also get to see how Martin deals with “Mr. Goldstone”, Slade’s bodyguard, who happens to know Mills from his previous mysterious line of work.\nThe writing for this book was a bit off on the first issue, seeing as it contains an almost ten-page long info-graphic on how the music industry works, step-by-step. However, it has been shown through these last two issues that Jeff Rougvie only wanted that explanation out of his way so he could focus on his story and characters. The story progresses beautifully at a moderate pace which only feels rushed, simulating a day in Martin Mills’ busy lifestyle. Martin’s thought boxes contribute with a personal and yet analytical take on everything that’s happening developing his character charmingly and helping indicate how much of a cold professional he can be. All other of Rougvie’s characters are still a bit in the dark. That trait accompanied by the artwork allows them to go from exaggeratedly funny to mob-boss level scary in a single panel, without it feeling forced at all.\nMoritat’s art for this book gives the reader a joyful ride and complements the story quite organically. The style varies from cartoonish and friendly to a detailed one whenever things get more serious making some of those legitimately creepy once the color work is added doing wonders on the shading of this comic. In both of those styles, the facial expressions are on point. The huge amount of details contributes for that naturally as do some of the cartoon elements in the comic, such as a star for eyes or the villainous grins some characters display. In addition to all that, the art still presents deeply detailed backgrounds but without driving the reader away from whatever’s happening in the panel.\nGunning For Hits might have started on a low note and scared some readers away on the first chapter, but Rougvie and Moritat have, since then, shown amazing synchrony in their work making for great storytelling on a charming, funny and instigating comic book.\n&lt;br /&gt;\n","score":9.2},{"title":"Meet The Skrulls (2019) #1","publisher":"Marvel Comics","writers":"Robbie Thompson","artists":"Artist: Niko Henrichon","date":"2019-03-07","body":"Marvel’s new five-issue mini-series Meet The Skrulls presents us with a Skrull family on their day-to-day life as they go on about their business which is to conquer and transform planet Earth into a new Skrull colony in order to get the Empire back on its feet, which was hastened by the failed attack from the Secret Invasion event.\n&lt;br /&gt;\nIn this first chapter we get to know a little about the main characters, their family dynamic, what is the Skrulls’ plan for Earth and about Project Blossom, which appears to be a government operation to eradicate every remaining Skrull on the planet. We’re first introduced to Alice Warner, who is the most curious and introvert of the family since she was raised on Earth. The rest of the family utilizes their jobs in big corporations or public institutions to move the Skrull agenda onward. The father, Carl, works at Stark Industries trying to sabotage any anti-skrull tech. The mother, Gloria, works in Congress and leads her boss towards a Special Projects Committee. And the eldest daughter, Madison, who befriends teenagers which parents are in important positions in government, aiming to infiltrate their household.\nRobbie Thompson conducts the story quite well considered the amount of information the reader gets. We get situation reports from the family members right at the beginning of the issue which serves both as character introduction and exposition on their operations among the regular humans, never interacting directly with any of the super people of Earth. Apart from that, Thompson manages to introduce a mysterious agent from Project Blossom as a scary foe and explore how much of a regular family the Warners really are even behind their disguises.\nThe art for this issue gets the job done spectacularly. Niko Henrichon’s work has been one of my favorites ever since his take on Doctor Strange. He manages to portray the varied facial expressions perfectly even for the Skrull characters. Speaking of Skrulls, Henrichon was able to draw them with tons of different features from one another making every member of the family recognizable even in their human forms. The color choice for this chapter is pretty good as well, maintaining a realistic mood throughout the issue fitting the spy theme and how everything is supposed to look normal.\nMeet The Skrull promises to be an interesting read from the very start. Mixing the themes of both family drama and spy thriller stories organically making sure the fans of both genres can enjoy this comic.\n \n&lt;br /&gt;\n","score":8.0},{"title":"Die #4","publisher":"Image Comics","writers":"Kieron Gillen","artists":"Artist: Stephanie Hans","date":"2019-03-06","body":"In this chapter the team is found heading themselves towards the first city to ever be founded in the world of Die, which they never visited.  They’ve heard stories about the place called Glass Town. They heard, from the people of Die, how magical the city was, which is to say it must be a pretty magical and amazing place. The party reaches Glass Town and realizes Solomon has taken over, put statues of himself all around, his face on the city’s highest tower and a shield shaped like his D20. Now the team must figure out whether Sol has set the city for or against them. We learn more about Matt’s past traumas and how evil and cruel Solomon’s reign as the Grandmaster has been.\nKieron Gillen has proven himself, once more after The Wicked + The Divine, a spectacular writer and storyteller. The plot keeps progressing at an extremely controlled pace reflecting how the main characters are still getting themselves used to the idea of being back in Die, of having to deal with the part of their lives they’ve kept away for twenty-five years. My favorite part of Gillen’s writing, however, is the fact that he, not only uses the plot to reference modern-day pop-culture in order to describe Die in the most clarifying of ways but also uses it to criticize some aspects of fantasy writing altogether. He consistently uses Ash’s thought boxes to comment on how structurally things are happening to the team and then breaks the pattern completely making the read an interesting study for wannabe writers. Better yet, Gillen breaks said structure just as we feel we’re about to get some exposition on the character’s past maintaining the chapter captivating without exposing too much just yet although we do get to know a little of revelations about the mentioned characters.\nStephanie Hans’ work continues to provide a beautiful book for every reader who picks this series up. Despite me not appreciating much how she draws facial expressions, Hans’ paints the world of Die in surprisingly new colors, considering just how much fantasy stories there are. Her extremely high level of detail comes deeply stylized and fantastical just as it should be not failing even once to immerse the reader in this scary new world. The panel in which Glass Town is presented literally took my breath away.\nIn this issue specifically, we see a constant and friendly shimmer in Glass Town which contrasts with the main character’s mistrust in what is Solomon’s town may represent in their quest. We also see Hans’ art in a simpler, storybook looking style, in a half page sequence, which manages to also look gorgeous displaying the amount of talent that the artist has up her sleeve and how much she can do for this series.\nDie proves itself to be an instant classic every new chapter. Breathtaking artwork accompanied by talented and experienced storytelling makes this chapter another delight in what should be a feast once this series is complete.\n \n \n","score":10.0},{"title":"West Coast Avengers (2018-) #8","publisher":"Marvel Comics","writers":"Kelly Thompson","artists":"Artist: Gang Hyuk Lim","date":"2019-02-27","body":"The new West Coast Avengers has arrived! Kelly Thompson once more presents us with a fun and yet involving read about the most precarious Avengers formation yet.\nStarting a new story arc, this issue kicks off with Marvel Boy trying to explain to the team why he got infiltrated in Madame Masque’s Masters of Evil. Turns out Noh-Varr is actually investigating a suspicious cult called The Temple of the Shifting Sun, which he firmly believes to be connected to the Skrulls… for some reason. The team infiltrates the temple and finds out that Noh-Varr’s guess couldn’t be further from the truth.\nKelly Thompson’s take on this team keeps getting better and better. Her title cards, that could’ve easily become repetitive by now, continue to be innovative and amusing, presenting the main characters in various ways. Thompson’s choice to stick to the mockumentary format for a comic book contributes greatly to expose developments in the story and especially in the team’s relationship as a whole, exploring how each character feels and thinks of one another evolving these relationships in a comic and yet believable approach. Of course, she also inserts such developments in the among the dialogues naturally, exhibiting just how talented of writer she is by not relying on the format for pure quirky exposition.\nGang Hyuk Lim makes the art for this chapter making it the most charmingly illustrated comic book I’ve ever seen. Lim clearly applies some aspects from the eastern style to the characters’ facial expressions and body reactions which are slightly exaggerated and perfectly drawn for the tone that Thompson has set for the series. Lim does keep most of his traces tending to curves instead of straight lines which contribute to making the characters looking a bit more cartoonish when appropriate. The few action scenes for this chapter are amazingly drawn, making the characters’ motions clear to the reader and exciting to look at.\nLim is also the colorist for this chapter and his work complements the charming tone I’ve mentioned above. Opting for bright pastel colors, Lim keeps the book light-hearted until the very end when the real threat is revealed, turning the colors to darker and more menacing shades.\nThis series makes for a delightful read in every single issue and it deserves tons of appraisal. I’ve loved every chapter’s artwork until now, Lim’s is easily my favorite since it fits so well with Thompson’s storytelling. I’m looking forward to the next issue and hope this title carries on for a while longer.\n \n \n","score":9.5},{"title":"Punks Not Dead: London Calling #1","publisher":"IDW Publishing","writers":"David Barnett","artists":"Artist: Martin Simmonds","date":"2019-02-26","body":"Feargal Ferguson, also known as Fergie, is a fifteen-year-old teenager that didn’t have many friends until one day he started talking to a ghost of a deceased punk rock band, Sid, to which apparently he’s stuck together. After dealing with bullies, magical ‘bombs’, the boys are headed to London with the police on their backs. This is the plot of IDW’s new Punks Not Dead: London Calling which took off in a quite promising way, with eccentric writing and gorgeous artwork.\nThis first issue picks up with Sid and Fergie on their way to London in search for Fergie’s father, hoping he can shed some light on the boy’s sudden magical powers. We get an introduction in plain text explaining the whole situation to the reader, recalling the events from the first volume. We also get to know about Fergie’s mom, Julie, and Natalie, Fergie’s not-a-girlfriend,  as they help each other to cope with what’s been happening. Agent Asif of the Department of Extra-Usual Affairs and the amazing douche Agent Culeppeper are also present in this miniseries. Yet another familiar face is the serial killer known only as Bobby who promised to help Fergie through the supernatural forum but clearly intends to hurt the boy. The new characters for this title appear to be yet another group of people interested in Fergie’s abilities.\nThe writing for this first chapter feels rushed on a first read, since pretty much happened in Punks Not Dead’s volume #1. If you choose to skip over the text introduction mentioned above you can get a grasp of what has already happened and why the main characters find themselves in London through dialogues. However, upon a second read, it’s possible to realize why David Barnett chose this approach.\nFor this first chapter, we are introduced to every element we need to know to get interested in the story without exception. Barnett reports the past events in a very fluid manner, mixing those facts naturally in conversations of various scenes, never once feeling like forced exposition making the read friendly for a first-time reader. Plus, Barnett managed to structure every page in its own singular grid type, utilizing of the storytelling tools the comic book media offers, in a masterful way.\nThe book is spectacularly illustrated by Simmonds. The backgrounds change from scene to scene, looking steady with firm and strong lines in scenes without any mystical elements involved, and appearing as sketches with loose lines and a different glow when the scene displays a magical manifestation or ritual. Each character has a unique design to them making it possible for the reader to pick up who is who quickly. My favorite element of the artwork, however, was the coloring. The regular elements of day-to-day life look opaque and bland, which makes every single magical element stand out since these are presented in neon tones of purple, green and blue, giving it all a heavier impact than on the first volume in which things just happened without much charm to them.\nThe great writing, gorgeous penciling, and breathtaking coloring are to show just how good the second part of Fergie and Sid’s story can come to be. This being the first chapter we already get beautiful pages of ‘exorcism’ and other mystical manifestations.\n \n","score":9.7},{"title":"High Level #1","publisher":"Vertigo","writers":"Rob Sheridan","artists":"Artists: Barnaby Bagenda & Romulo Fajardo Jr.","date":"2019-02-21","body":"This week we got to take a look at what Rob Sheridan, former art director for Nine Inch Nails, had to offer for the comic industry. I must say, despite not knowing any of his previous works I’m confident Sheridan has a great read prepared for us.\nIn this issue, we meet Thirteen, a freelance smuggler who is happy and satisfied with her lifestyle in a world rebuilt after an apocalypse while her friends insist on seeking a better life. Thirteen is a brave and witty woman who is shown to have trouble with the law, represented in this issue by the so-called Black Helix Squad. She ends up being hired by Akan, who is implied to be a former lover, to take a young girl, Minnow, to the titular mythical city of High Level so that she can end the war, which we know nothing about just yet.\nRob Sheridan presents himself as a talented writer with maybe a little problem to his pacing but that maybe only for this introductory issue. I mention that, because, even though the story doesn’t progress as much as it is set up, we get a lot of information in this single chapter. We get to know Thirteen and her behavior, how she reacts to emergency situations, her friends, her home and a lot more. But, despite that overload, I’m obligated to say that there’s little actual exposition present in the writing. When it is present, it happens through dialogues that come naturally between Thirteen and her friends about the mysterious High Level, mostly informing the reader what is believed about the city rather than how it really is.\nThe artwork for this comic is already quite promising. Every character has its own unique design and is unmistakable among the others. Although it takes place on a futuristic Earth, Bagenda took liberty to create a freaky design, with spider legs and rotating saw arms, for a religious leader that appears to preach full transition to a mechanical body as freedom of a sinful life. Another strong-point for the art are the backgrounds. The establishing panels look a lot like concept arts we see normally for video games, and I mean that in a good way, because I usually love those. Every single panel is rich with detail, Barnaby even took advantage of some narrating to expose the image that some characters had of High Level and it looks incredibly beautiful. The only downside for the art maybe the facial expressions that do not do justice to the characters’ dialogue most of the times, but I bet that can be easily corrected.\nThe coloring complements the pencils wonderfully as every character has a rich color pallet aiming for a lively, yet opaque, environment in Thirteen’s home town reflecting instantly her satisfaction with her current lifestyle. Another neat detail noticeable for this issue, is the lettering for Thirteen’s narration as it changes color to match her hair dye giving the comic an extra bit of style it didn’t actually need, but it sure is welcome.\nHigh Level comes in its first issue with a lot of information, but every single piece of it makes the reader excited to learn more about this world as it comes accompanied with magnificent artwork and through tremendously talented storytelling.\n&lt;br /&gt;\n","score":9.7},{"title":"","publisher":"Doctor Strange #11","writers":"Marvel Comics","artists":"Writer: Mark Waid","date":"2019-02-21","body":" \nIn the newest chapter of Mark Waid’s run of Doctor Strange, we pick up where the last issue left off at a burning, Faltine-infested New York.\nIn this issue, Stephen decides to serve as a distraction for Dormammu while his friends are sent back to The Accountant’s office to try and find a solution to this current problem. Although I was glad (at first) to see the classic Doctor Strange villain, the change of setting for Waid’s run wasn’t my favorite decision. He was doing a good job taking Stephen into a cosmic environment and showing new kinds of alien magic/technology, and the run took a bad turn when Stephen got back to Earth and he continues to let this reviewer down every month. The conclusion to this two-part arc was bland and quick providing the reader with a fun but forgettable read.\nWaid’s writing is not bad. As I previously mentioned he was doing a tremendously good job mixing up Doctor Strange’s mysticism and science fiction. It was an instigating and innovative approach on a magic centered character, especially because he seemed to be undoing the whole “magic has a price” thing that has been the core to every Doctor Strange story since The Last Days of Magic. But, as soon as Strange got back to Earth the same theme returned, now introducing an actual accounting firm for magic use, which apparently was the idea from the very beginning of his run and that feels extremely disappointing. For this issue, the writing didn’t improve. Last month, Waid set up a threat and made it look highly menacing and serious, this issue contradicts that set up giving Dormammu a poor motivation for his new move on Doctor Strange and resolving the situation completely with a single course of action from the characters.\n \nJesus Saiz’ pencils fall short on this issue. Probably because Saiz appears to give more attention to little details in character and equipment design. This issue, with giant Faltine people, requires a bigger scale, making Jesus’ art look boring and only sufficient. The artist doesn’t seem to care much for movement portrayal as most of the fight scenes in this issue are composed with a different fight stance to each panel without any movement line whatsoever, failing to represent the transition between said stances.\nEven though the penciling for this issue isn’t as good as it was for the previous because of the scale problem, the coloring remains excellent.  The use of warm colors serves to provide the reader with the awareness of the burning city. And, like it has been since the beginning of this run, the contrast between the predominant opaque colors against the bright shades that compose the magical circles/beams and fire give these elements more lighting which make them feel more powerful and special.\nI did not like this issue as I didn’t like the previous one that took place on Earth, but Galactus should appear on the next issue making me hope Waid takes Doctor Strange back to space and gives this series that fresh sensation it gave the readers on its starting point.\n \n","score":6.7},{"title":"Sharkey The Bounty Hunter #1","publisher":"Image Comics","writers":"Mark Millar","artists":"Artist: Simone Bianchi","date":"2019-02-21","body":" \nThis week we got the release of yet another of Mark Millar’s projects associated with Netflix, this one planned to become a live-action movie to be released on the streaming platform.\nSharkey The Bounty Hunter introduce us to a world of crazy science fiction with some familiar concepts, for instance, intergalactic bounty hunting and weird alien bars. We are also presented, however, a few weird new concepts, for example, an alien identifying as a machine and being mid-transition to her true self. This issue serves as a kick off to the actual story as we get to see how some characters meet for the first time, who they know and who knows them, clearly meaning to situate the reader first before taking off to some crazy Millar script.\nWe get to know Sharkey, a bounty hunter with financial problems going after a new big score that should clear all of his debt. Sharkey is, however, stuck with Extra-Billy, Sharkey’s latest bounty’s nephew, who demands he must be taken by Sharkey to his closest family member in a distant planet, taking advantage of the bounty hunter’s apparent noble military past.\nThe writing for this issue is what I consider the best of Mark Millar’s writing: construction. The reader is presented a new universe and the many possibilities contained in it, along with the characters of the story in a very elegant way. Millar makes good use of this universe and it’s inhabitants’ designs to show how things are different rather than focusing on narration or exposition dialogues. Sure, there are a few of those through the comic, but they are scripted in a believable manner so that only the more habituated (and nit picky) reader will notice.\nThe highlight for this new title will certainly be Simone Bianchi’s artwork. Her character design is amazingly weird and beautiful at the same time making me pretty confident she translates what was on Millar’s mind as he was writing. Her style is incredibly realistic for a sci-fi story, despite her facial expressions looking a bit off here an there although Sharkey’s smug look, faces and poses, show the readers just what kind of character they’re gonna get from this title. Bianchi’s backgrounds are incredibly pretty as they show us enough detail to be awed and get a general grip of the environment. Simone also being the colorist only serves to earn her even greater merit. The colors are presented as if to appear like a watercolor paint was used giving the characters designs’ a bigger depth, contributing with a weird texture and shade to each one of them.\nI liked this issue a lot. It shows us a promising universe and interesting characters. But, as I mentioned before, this is what Millar’s appears to do best and, even with Bianchi’s art, I consider it wise to not get my hopes up too high, just so I don’t get disappointed with Millar’s writing yet again. I recommend picking this up so you can see for yourself if it’s worth the money of buying an issue a month.\n&lt;br /&gt;\n","score":9.2},{"title":"The Magic Order #6","publisher":"Image Comics","writers":"Mark Millar","artists":"Artists: Olivier Coipel","date":"2019-02-13","body":"On this conclusion to another of Mark Millar’s project on Netflix, we finally understand what caused all the betrayal and violence that led up to this point, although much of it just felt like it was pretty obvious to begin with.\nThe issue continues where issue #5 left off as Gabriel reveals his reasons for betraying his family and aiding Albany on her plans. As the reader goes through this review they might have some theories of their own, had they not read the issue yet. Sadly the theory that instantly pops on any reader’s mind is what Millar used to conclude the story. It isn’t even properly explained by Gabriel as he goes on for only four panels about his reasons.\nDespite that, I liked the story and its conclusion. We are presented even another twist to counterbalance last issue’s and, even though it may feel like an ex-machina (because it kind of is), it’s passable since Millar reminds us of Cordelia’s personality and her fame among the Order and since we’re talking about magic. The twist and it’s presentation feel exciting as we get to see Cordelia actually helping out after all this time. Another interesting factor about this twist is how Millar, by using the twist in the story, implied a certain hypocrisy to The Magic Order as he tends to do on various of his fictional organizations.\nIf it feels like I’m focusing too much on this final twist it’s because it is the best part of this series’ writing. The rest of the book feels off. Firstly, the ending felt extremely rushed presenting most of the final consequences of the whole happening in a single dialogue sequence between Cordelia and her father. Those consequences also being escalated too quickly.\nSecondly, there was a lot of build up throughout the whole series about how powerful a mage Gabriel was and yet his conflict is also resolved abruptly making it feel like Mark Millar merely used this build up so that he could avoid writing an action sequence against the over powered character, which proves its difficulty, but still feels lazy.\nThe artwork for this issue, as well as for the whole book, is amazing and it’s sad that it accompanied such average writing. Coipel’s pencils are beautiful, portraying the mystical elements of the universe in a realistic way making it all look like a raw type of magic that really messes with reality. This realism presented by Olivier also makes for greatly expressed characters and gore elements that Millar loves so much in his works. All that and the sense of movement Coipel is able to deliver with his drawing makes The Magic Order a wonderful looking book with so-so storytelling.\nThe Magic Order presents us with interesting characters and an interesting universe. Sadly that is what seems to make Millar’s writing: great narrative construction but average narrative conduction as it has been a while since I read something of his that didn’t feel rushed at the end. That being said, this is still an amazingly illustrated book that gives us a good read at the end of the day.\n","score":6.3},{"title":"Criminal (2019-) #2","publisher":"Image Comics","writers":"Ed Brubaker","artists":"Artists: Sean Phillips & Jacob Phillips","date":"2019-02-12","body":"Since Criminal is the first work I’ve ever read of the Brubaker-Phillips team-up, I feel obligated to state I regret not picking up any of their other books before. This is still the perfect pairing for a noir tale as the current releases continue to show.\nOn the second issue of the new Criminal series iteration, we pick up in a very different setting from the first issue’s ending. Nine years after those events (issue #1 took place in 1988), the reader is presented a man, Jacob, who is being requested to be his old mentor’s “minder”. Jacob used to be the assistant to legendary comic book artist Hal Crane and appears to be very uncomfortable with the idea of being around Crane. As the story goes forward, the reader is shown just how distressed anyone would be caring for a man with Hal Crane’s general behavior.\nFor someone who had never read any of Brubaker’s books, I was delighted to get a taste of his writing in the first two issues of this series. Focusing mostly on internal dialogue or narration, Brubaker delivers the reader that noir feeling. But that’s barely all of it. Although the issue contains plenty of exposition panels and flashbacks, the story is not at all held back since said exposition is either directly related to the situation shown in the panel or made during a silent drive from one point to another. An interesting trait of the storytelling is how Brubaker introduces us to two characters in the same way. We get to know Jacob because we get to read his thoughts about Hal and we get to know Hal in the same manner. These aspects of Brubaker’s storytelling are evidence of how much of a competent writer he is.\nThe art for this issue maintains the level of quality any reader would expect from Sean Phillips, in this series counting on his son for the coloring. As if it was easy to them, the art team makes every panel of the comic feel like a painting on it’s own, rich with detail from top to bottom. This is easily noticed in panels where the characters are in a moving car at night. The exterior of the car could simply be shown as a blur, or not be shown at all, yet, the team turned that blur into a beautiful color composition to portray the street lamps and cars which pass by outside.\nEvery single one of the characters’ expressions presented by Sean are crystal clear about how they feel, utilizing of expression lines in character’s faces turning the portrayal realistic and complementing the story perfectly. Another amazing trait of the artwork is the choice of colors. As the story progresses and Hal shows his less friendly side more and more, the color pallet goes from a shiny day, composed of warm opaque colors, to a dark night, depicted using cold tones and giving the characters a certain shimmer to indicate artificial lighting in the scene.\nCriminal would be worth the read even if it was just about getting to know the creative team’s capabilities since it feels like a one-off with no correlation with issue #1 yet. Terrific writing along with a spectacular artwork makes me glad that I picked this up and anxious for more.\n","score":8.7},{"title":"Man Without Fear (2019) #5","publisher":"Marvel Comics","writers":"Jed MacKay","artists":"Artist: Danilo Beyruth","date":"2019-02-01","body":"It’s finally here. The conclusion to MacKay’s interlude and starting point to Zdarsky’s take on Daredevil. And it’s amazing!\nOn this spectacular conclusion we see Matt finally figuring out how he will overcome his current situation and remain Daredevil even though he is no longer the Man Without Fear leaning on the only lesson his father could ever teach him: use pain to move forward. I liked it a lot that not only Murdock’s resolution didn’t come from other people, which we saw trying to console him throughout the mini-series, but from Matt’s own past and wisdom, acquired through years of getting beat down.\nThe storytelling for this issue felt very sentimental. Not only about Matt’s relation with his father, which every now and then resurfaces as a catharsis yet is always welcome, but also about Daredevil’s passion for his city and his mission (traits of the character that led me to reading the D.D. mythos) are transformed in determination to get through the dark times once more.\nMacKay’s writing, continues to be the stronghold for the series, this time conducting the narrative through Mathew and his father’s dialogue about dealing with the cards life deals you, in a flashback, alternated with internal dialogue/dialogue with his Fear about how a hero doesn’t need to be without fear. The last one proving just how ready Murdock really is to live while afraid.\nDanilo Beyruth is back for this final issue and, though all of the artists in this series deserve renown, it’s refreshing to see his artwork once again. And it’s good he’s back, since Beyruth’s clear familiarity with the human form allows him to portray the fight scenes in this issue with amazing realism yet without losing his cartoonistic-ish charm. The artwork for this issue even reminded me, of John Romita Jr.’s work, specially in the boxing panels, which I write as a compliment since I love JRJr’s art style.\nThe conclusion for this series didn’t come as I expected. I thought it would leave on an open ending and then Zdarsky might pick it up. But the actual ending was much better. The interlude is self-contained, making its main plot a new insight into Matt Murdock’s now afraid mind, and concluding the presented dilemma in an emotional, beautiful and epic way. This issue contains, yet again, sensational writing and storytelling, beautiful artwork and harmony between all of its elements that definitely make a great comic.\n","score":9.8},{"title":"Man Without Fear #4","publisher":"Marvel Comics","writers":"Jed MacKay","artists":"Artists: Paolo Villanelli & Andres Mossa","date":"2019-01-24","body":"One issue away from the conclusion of this interlude, Matt Murdock gets yet another visit at his hospital bed. As we already saw what many of his friends had to say about his current state of mind, now the readers get to know the input from one of Daredevil’s greatest foes: The Kingpin.\nIn this chapter we learn Wilson Fisk and Matt Murdock’s take on their first encounter. We’re also shown just how afraid Matt is in this, clearly scary, situation. His nemesis standing over his defenseless, broken body and the most Murdock can do is lie there, pretend to be asleep and cope with the Fear incarnation (the one from issue #1) whispering in his ear.\nAlthough MacKay, at first, appears to reiterate last issue’s format, present time alternated with flashbacks, he did something different. This time he presented the narrative from a subjective point of view instead of a more objective one. We are presented with both hero and foe’s opinions and feelings on the details of their first duel.\nAnother amazing feature of MacKay’s writing in this issue is Wilson Fisk’s characterization through his dialogs, more specifically his gloating. Composed of such low and petty regards yet coming out as a classy statement that displays to the reader just how evil, though charming and powerful Fisk really is.\nThe artwork for this comic, despite feeling very similar to Landini’s work in issue #2, presents itself with its own qualities. Villanelli’s traces bare some resemblance to Japanese manga style, specially in the action scenes. Such distinctive art style alongside Mossa’s colors present the reader with a beautiful set of panels for every page of this book adjusting the lighting perfectly whether to portray an ominous Fisk entering the hospital room or simply showing the room as it is, in a more realistic manner.\nMan Without Fear has build itself, from issue #1 with the possibility of there never being a Daredevil anymore. Despite my initial beliefs, this interlude has shown itself creative in treating that subject as I’m sure it’ll be creative in it’s conclusion, providing the readers with a intriguing read and an interesting insight on Murdock’s mind as he goes through, yet another, difficult time. I’m looking forward to the final issue and I really hope the build up pays off.\n","score":7.7},{"title":"Exorsisters #4","publisher":"Image Comics","writers":"Ian Boothby","artists":" Artist: Gisèle Lagacé","date":"2019-01-22","body":"Exorsisters‘ storyline focus on the jobs of two twin sisters that work as professional exorcists for anyone that is able to hire them. As a magic and mysticism fan myself, I got very excited when I read the synopsis to this series. Tragically my enthusiasm was practically gone by the end of this last issue.\nIn the fourth chapter of the sisters’ story, we follow them as investigate the angel rain which concluded issue #3. Mid-investigation they encounter a man claiming another man, dressed as the devil, is trying to steal the first one’s soul. This all leads to a neat twist and a well-paced build up for the villain’s official presentation which appears to be on its way in the next issue.\nThe first thing I’d like to make clear about the writing is that I’ve never read any other of Boothby’s work. That being said, I do think he does a fine job keeping an engaging narrative throughout the whole issue. He delivers likable characters and funny situations that help to keep the reader entertained. However, the main storyline seems to be taking too long to build itself never being the main encouragement for the reader to buy next month’s issue. Surely the idea may be to slowly build the tension on this world, but the chapters definitely cannot sustain themselves for much longer.\nThe magic in this series also fails to deliver, at least on these first issues. It all feels average. Of course, there is a mention of Heaven, Hell and what can or not be done here or there, but none of it innovates in any way whatsoever. I’m not trying to tell Boothby how to write fantasy, but the magic has been coming across more like a plot device than an element for the story.\nThe artwork in this series as a whole has undoubtedly been one of my biggest disappointments. I thought I was reading a tale of exorcism, demons, and magic which are, very often, not cute at all. Lagacé’s art is beautifully executed and she’s an artist that deserves recognition, but I cannot see how her work fits in this series, always highlighting Boothby’s light moments and never his dark ones. I’m pretty sure contrast between the theme of the series and its artwork was what they were aiming for except even Lagacé’s demons and creatures are incredibly bland and harmless, failing disastrously at inspiring fear.\nDespite being the result of a partnership between to extremely capable professionals, maybe they should’ve passed on their idea to another set of artists or tried a different, more dark approach. This comic has great potential and maybe it lifts after having the chance to dive deeper into its own mystical world and show different creatures and their designs, sadly, however, I don’t have strong hopes that it will.\n","score":6.0},{"title":"Man Without Fear #3","publisher":"Marvel Comics","writers":"Jed MacKay","artists":"Artist: Iban Coello","date":"2019-01-17","body":"On another issue of MacKay’s interlude before the new Daredevil series, the story continues to follow Matt’s discussions with his friends about whether he should or shouldn’t give up the Daredevil mantle. We get to see more of Daredevil’s friends as they help him with his Physiotherapy for his legs so he may walk again. This time the rest of The Defenders (Jessica Jones, Luke Cage, Iron Fist) take turns on helping Matt. Again, each one offering their own take on Murdock’s current situation and dilemma. Sure it sounds repetitive and very similar to the issue #2 but now we get a narrative alternating between the physio sessions and a past Defender’s mission in which the team had to protect Ben Urich as we understand why Daredevil is known as “Man Without Fear” even by other superheroes.\nMcKay’s writing has shown itself amazingly fluid in style, meaning, there hasn’t been a pattern of storytelling since issue #1, they were all very different and unique on their own. In this one, he mainly relies on actual dialogue between characters instead of narration or inner dialogue. The pace in this issue is also pretty good, always switching back and forth from present days to flashback. This works out perfectly as the read goes by without any trouble and both stories amount to conflicting endings directly related to the title of this mini-series. The only negative aspect of the writing (maybe) is that this time, MacKay opted for a less judgemental dialogue coming from Murdock’s visits, which made the Defenders feel like they were closer to Matt than Foggy is.\nThis issue contains delightful artwork. Right on the first page, we get to see outstanding detail work on Murdock’s face, legs and hand displaying all of his struggles as he tries to walk again. I also loved how it was obvious who the new characters in the story were, simply based on the art style alone, dismissing any presentation titles/boxes. That being said, the characters’ design in this issue carried a lot more style to them in comparison to issue #2 artwork that was clearly based on the TV show. Another gorgeous detail is how Coello represented motion in various ways, for example, blurred characters, all of which were incredibly appropriately used.\nThis issue confirms what I thought: this interlude intends to take a deeper look into Matt Murdock’s character as it sets the ground for the upcoming series. We’ll probably not have any issue with more action than this one, since the focus is not a fight with a new enemy, but to explore the main character and what may happen to the man without fear.\n \n","score":8.8}]