[{"title":"Wynd #5","publisher":"BOOM! Studios","writers":"James Tynion IV","artists":"Michael Dialynas & Aditya Bidikar","date":"2020-10-28","body":"This is it. The final issue of Wynd’s first step into a new world and life. This week we get the conclusion for the first volume of BOOM! Studios’ Wynd.\nYorik and Thorn are waiting on the hill for the Faerie General to come and get them. Wynd has run off aiming to misdirect the Bandaged Man and the rest of the King’s Men. Thorn and the prince have a serious talk about how Yorik has taken up an important mission and should start to act more like royalty. Wynd, in the meantime, also has a talk… with the Bandaged Man himself!\nJames Tynion IV has been making a lot of noise in the comic industry lately and Wynd is a great example as to just why. The writer has a great talent for writing compelling characters making all of them genuinely unique yet relatable in their own way. He’s able to take a somewhat boilerplate fantasy hero’s journey story and give it enough twists so that it feels incredibly fresh. Wynd is an amazing protagonist who we get to know most when he interacts with the rest of the diverse cast. The character grows in what could be considered a rushed manner, but it doesn’t feel like that at all. Little hints and nods at what’s coming is what made it all come together nicely by the end of this first volume.\nWithout a doubt, Michael Dialynas’ art is a crucial part of this comics’ soul. His style leans more towards the cute cartoony side. Nevertheless, the artists’ facial expressions are, at least for me, what most helped to sell the seriousness of the events of these last issues. His colors are more attached to the comics’ realism, being bright if it’s sunny and dark if the panel is underground. The highlight of his work, though, the character design! Good lord, I loved every single one of them. At first, the reader tends to notice the more blatantly awesome ones such as the Bandaged Man (both in and out of bandages) and the Faerie general. Later, however, even the more simply composed character bares these tiny details that inject an amount of soul into the said character and it just gets a lot better. My favorite instance of this is Wynd’s knee-tall converse shoes.\nAditya Bidikar is easily one of my favorite letterers out there. His bubbles and fonts are rather regular and get the job done, but as far as I see it, he shines when it comes to the sound effects. Not only they’re spectacularly well placed in order to get the most of every dramatic moment but they’re also well colored. The sound effects are given whatever color mixes in best with the page and brings forth a sense of volume to it. That’s just mind-blowing when you’re involved in the reading.\nThis was an epic first volume. As I mentioned early this could have just been another fantasy hero’s journey. It was a hero’s journey, but not just another one. Wynd takes many established tropes as a guide but never as a rule and the talented team behind it gives the soul of this comic that reflects just how much passion and dedication was put into this project. Wynd’s story is not over. This was just the beginning and I, for one, cannot wait for the next chapter.\n","score":9.3}]